Repository: knyghtmare/Electrifyre
Catalog: translations/wesnoth-Electrifyre/*.po
Languages: es

source: Swordsmen excel in close combat against enemies vulnerable to their slashing attacks. Use them strategically in smaller numbers to take advantage of this strength. Their upgrades offer specialized options to enhance either their survival or damage output.
es: Los Espadachines destacan en combate cuerpo a cuerpo contra enemigos débiles al daño cortante. Úsalos estratégicamente en menor número para aprovechar esa ventaja. Sus mejoras son especializadas: algunas aumentan la supervivencia y otras el daño.

source: Scouts are faster than Spearmen but weaker than Eagle riders. Use them to quickly deal piercing damage in situations where you need it right away.
es: Los Exploradores son más rápidos que los lanceros, pero más débiles que los jinetes de águila. Úsalos para infligir daño perforante rápido cuando lo necesites de inmediato.

source: It's a fire elemental!
es: ¡Es un elemental de fuego!

source: <i>Fire Guardians</i> have decent melee and ranged attacks. Thus, it is an optimal tactic to strike them first and strike them hard.
es: Los <i>Guardianes de fuego</i> tienen ataques cuerpo a cuerpo y a distancia decentes. Por eso, la táctica ideal es golpearlos primero y golpear fuerte.

source: Woah, it's an ice ghost!
es: ¡Vaya, es un fantasma de hielo!

source: <i>Ice Ghosts</i> prefer to inflict <i>slow</i> on your units and let the other units deal with your slowed units afterwards. It is recommended to attack them with the ranged attack of <i>Aragwaith Adepts</i> and then finish them off with either a Spearman, a Scout or a Swordsman.
es: Los <i>Fantasmas de hielo</i> prefieren ralentizar a tus unidades y dejar que el resto las remate. Se recomienda atacarlos primero con el ataque a distancia de las <i>adeptas aragwaithi</i> y luego terminarlos con un lancero, un explorador o un espadachín.

source: It's a mud elemental!
es: ¡Es un elemental de barro!

source: <i>Mudcrawlers</i> and their giant variants are weak elementals created from earth. They prefer sticking together in packs. An Aragwaith Adept can incinerate them with ease.
es: Los <i>Reptadores de barro</i> y sus variantes gigantes son elementales débiles hechos de tierra. Prefieren andar en manada. Una adepta aragwaith puede incinerarlos sin problema.

source: We lost someone!
es: ¡Perdimos a alguien!

source: Stick together and do not let them surround you! Focus your attacks and take them out swiftly.
es: ¡Manténganse juntos y no dejen que los rodeen! ¡Concentren los ataques y elimínenlos rápido!

source: Ouch! I underestimated you lot...
es: ¡Auch! Los subestimé…

source: Where are you taking the relic?!
es: ¡¿A dónde llevan la reliquia?!

source: Our fortress... South... Further South...
es: Nuestra fortaleza… al sur… más al sur…

source: He died from his wounds...
es: Murió por sus heridas…

source: He mentioned a fortress further south from here. That must where they are heading with the sword.
es: Mencionó una fortaleza más al sur. Ahí deben estar llevándose la espada.

source: What should we do? Should we send a scout to Astya?
es: ¿Qué hacemos? ¿Enviamos un explorador a Astya?

source: That would not do us any good. Too much time would have passed by the time they arrive. The sword and the mages will have gone with the winds by then.
es: Eso no serviría de nada. Cuando llegaran ya habría pasado demasiado tiempo. La espada y los magos se habrían ido hace rato.

source: Many of us have not even left the outskirts of the village. Can we really bring it back?
es: Muchos de nosotros ni siquiera hemos salido de las afueras del pueblo. ¿De verdad podemos recuperarla?

source: Do you remember the stories of Ryuuma the Hero? Would he back down from this if he was here?
es: ¿Recuerdan las historias de Ryuuma el héroe? ¿Él se rendiría ante esto si estuviera aquí?

source: No, he would not. The sword belongs to the village, we have to get it back.
es: No, no lo haría. La espada pertenece al pueblo, tenemos que recuperarla.

source: <b><i>Cheers of determination resonated through the Aragwaithi!</i></b>
es: <b><i>¡Gritos de determinación resonaron entre los Aragwaithi!</i></b>

source: It's decided then. Assemble a raiding party! We are going South.
es: Entonces está decidido. ¡Formen un grupo de asalto! ¡Vamos al sur!

source: Haha! Time to go!
es: ¡Ja ja! ¡Hora de irse!

source: Oh, no! He escaped!
es: ¡Oh, no! ¡Se escapó!

source: Before he started attacking us, one of his underlings made off with the sword. They were dashing southwards.
es: Antes de que empezara a atacarnos, uno de sus subordinados se llevó la espada. Iban corriendo hacia el sur.

source: That's the only clue we have. I suggest we go south.
es: Esa es la única pista que tenemos. Sugiero que vayamos al sur.

source: Wild Knolls
es: Colinas salvajes

source: Save Ayanami from the vicious insects
es: Salvar a Ayanami de los insectos feroces

source: Find all the scattered pages
es: Encontrar todas las páginas dispersas

source: Death of Ayanami
es: Muerte de Ayanami

source: Use Scouts to rush ahead and help your ally.
es: Usa exploradores para avanzar rápido y ayudar a tu aliada.

source: Avoid recruiting/recalling too many Scouts.
es: Evita reincorporar o reclutar demasiados exploradores.

source: Use Spearmen as shields to withstand the enemy attacks.
es: Usa lanceros como escudos para resistir los ataques enemigos.

source: Use Archers against enemies with no ranged attack.
es: Usa arqueros contra enemigos sin ataque a distancia.

source: Use Adepts to heal injured units.
es: Usa adeptas para sanar a las unidades heridas.

source: Confront the caves in groups of three-four units.
es: Enfrenta las cuevas en grupos de tres o cuatro unidades.

source: Recall costs are a fraction of the recruit cost.
es: El costo de reincorporar es una fracción del costo de reclutar.

source: Have around 42 gold left over while saving the allied leader.
es: Deja aproximadamente 42 de oro mientras salvas a la líder aliada.

source: The mages must have gone through here.
es: Los magos deben haber pasado por aquí.

source: There are a lot of wild beasts here. We should be careful while we advance.
es: Hay muchas bestias salvajes aquí. Debemos tener cuidado al avanzar.

source: Fellow Aragwaithi, please help us!
es: ¡Hermanos Aragwaithi, por favor ayúdennos!

source: They seem to be under attack!
es: ¡Parece que están siendo atacados!

source: Hikaru, send in some scouts first to keep the ants busy. Infantry won't reach them in time.
es: Hikaru, envía primero a algunos exploradores para mantener ocupadas a las hormigas. La infantería no llegará a tiempo.

source: Quick, scouts! Ready your spears and rush ahead! We shall catch when we can!
es: ¡Rápido, exploradores! ¡Preparen sus lanzas y avancen! ¡Los alcanzaremos cuando podamos!

source: Let's go!
es: ¡Vamos!

source: In this scenario stage, your ally needs immediate assistance from you but is far away. Your infantry type units cannot reach them on time. In this case, you should intially recall scouts and send them in first to delay and harass the wolves, allowing time for your infantry to arrive and finish them off.
es: En esta parte del escenario, tu aliada necesita ayuda inmediata pero está lejos. Tus unidades de infantería no llegarán a tiempo. En este caso, debes reincorporar exploradores y enviarlos primero para retrasar y molestar a los enemigos, dando tiempo a que llegue la infantería y los remate.

source: Thank you so much, friends! We are grateful for the rescue!
es: ¡Muchas gracias, amigos! ¡Estamos muy agradecidos por el rescate!

source: My name is Ayanami and I am a researcher at the city of Aeranas.
es: Me llamo Ayanami y soy investigadora en la ciudad de Aeranas.

source: The far Northern city? You seem to be a long way from home.
es: ¿La ciudad del lejano norte? Estás muy lejos de casa.

source: Yes, I am. I am currently on an expedition to search for some lost magic material from ancient times. I have ascertained that they are here somewhere.
es: Sí, así es. Estoy en una expedición buscando materiales mágicos perdidos de la antigüedad. He confirmado que están por aquí, en algún lugar.

source: We are currently on a quest as well. Our village heirloom has been stolen and we must reclaim it.
es: Nosotros también estamos en una misión. Nos robaron la reliquia del pueblo y tenemos que recuperarla.

source: A theft? That sounds terrible. If I can finish my task here, I suppose I can lend my aid.
es: ¿Un robo? Eso suena horrible. Si termino mi tarea aquí, supongo que puedo ayudarlos.

source: What are you looking for?
es: ¿Qué estás buscando?

source: There are three magically protected pages somewhere here. I am looking for them.
es: Hay tres páginas protegidas mágicamente por aquí. Las estoy buscando.

source: That should not take very long. If we work together, we can find them in no time!
es: No debería tomar mucho tiempo. ¡Si trabajamos juntos, las encontraremos en un instante!

source: I will let you have some of my adepts for this search.
es: Te dejaré algunas de mis adeptas para la búsqueda.

source: You can now recruit <b><i>Aragwaith Adepts</i></b>!
es: ¡Ahora puedes reclutar <b><i>Adeptas Aragwaithi</i></b>!

source: Hey, I found one of the pages!
es: ¡Oye, encontré una de las páginas!

source: Excellent!
es: ¡Excelente!

source: Thank you all so much for helping in this endeavour!
es: ¡Muchas gracias a todos por ayudar en esta tarea!

source: You are welcome. We always help people in need of it.
es: De nada. Siempre ayudamos a quien lo necesita.

source: I wish you all the best in your coming battles and adventures.
es: Les deseo lo mejor en las batallas y aventuras que vienen.

source: Thank you, Lady Ayanami!
es: ¡Gracias, señora Ayanami!

source: Allow me to join you in your quest, friends. You have rescued me from certain death and I must return the favor.
es: Permítanme unirme a su misión, amigos. Me salvaron de una muerte segura y debo devolverles el favor.

source: Welcome, Eikichi! Your archery expertise shall be invaluable to our quest!
es: ¡Bienvenido, Eikichi! ¡Tu habilidad con el arco será invaluable en nuestra misión!

source: Looks like this is the end for me!
es: ¡Parece que este es mi fin!

source: How did we let her die? She could have given us some adepts!
es: ¿Cómo dejamos que muriera? ¡Nos podría haber dado algunas adeptas!

source: She was a vicious foe!
es: ¡Era una enemiga feroz!

source: It is sad we had to eliminate them. They were simply guarding their homes...
es: Es triste que tuviéramos que eliminarlas. Solo estaban defendiendo su hogar…

source: Oh, hello.
es: Oh, hola.

source: Are you a faerie?
es: ¿Eres un hada?

source: Yes, I am. This is my home.
es: Sí, lo soy. Este es mi hogar.

source: Would you like help us out?
es: ¿Te gustaría ayudarnos?

source: No, I don't think I will. I have things to do here.
es: No, creo que no. Tengo cosas que hacer aquí.

source: I am going back to my hut!
es: ¡Me regreso a mi choza!

source: Hey, I see someone! He's barely alive! Come, quick!
es: ¡Oye, veo a alguien! ¡Apenas está vivo! ¡Vengan rápido!

source: Thank you...for saving...me...
es: Gracias… por salvarme…

source: Rest now. We can talk after you have healed up.
es: Descansa ahora. Hablaremos cuando te hayas recuperado.

source: This loyal unit is injured and should be placed next to a healer or in a village to receive healing.
es: Esta unidad leal está herida y debe colocarse junto a un sanador o en un pueblo para recibir curación.

source: We have delayed far too long here! I fear we already lost the chance to reclaim the heirloom.
es: ¡Nos hemos demorado demasiado aquí! Me temo que ya perdimos la oportunidad de recuperar la reliquia.

source: Southern Sojourn
es: Estancia sureña

source: Reach the southern edge of the map with Hikaru
es: Llegar al borde sur del mapa con Hikaru

source: Engage the isolated enemy units in groups of 2 or 3 units.
es: Enfrenta a las unidades enemigas aisladas en grupos de 2 o 3.

source: Use Eagle Riders to rush ahead and flank retreating enemies.
es: Usa jinetes de águila para avanzar rápido y flanquear a los enemigos que se retiran.

source: Try to level up a Swordsman into a Guard.
es: Intenta subir de nivel a un espadachín hasta guardia.

source: Attack during the day, defend during the night.
es: Ataca de día, defiende de noche.

source: Hikaru, we have now entered vampire lands!
es: ¡Hikaru, ya entramos en tierras de vampiros!

source: I would prefer to avoid a confrontation with them for as long as possible. Exhausting our forces before we even get near the fortress would not bode well for us.
es: Prefiero evitar un enfrentamiento con ellos todo el tiempo que sea posible. Agotar nuestras fuerzas antes de llegar cerca de la fortaleza no sería bueno para nosotros.

source: I advise caution. There are vampires ahead!
es: Recomiendo precaución. ¡Hay vampiros adelante!

source: Ah, Aragwaithi. Those mages and dwarves told us you would be showing up. Turn back now.
es: Ah, Aragwaithi. Esos magos y enanos nos dijeron que aparecerían. Den la vuelta ahora.

source: We are looking for some magicians carrying an artifact. Did they pass through here?
es: Buscamos a unos magos que llevan un artefacto. ¿Pasaron por aquí?

source: They have passed through here three days ago. They have also paid us a lot of gold and blood potions just to bar you passage.
es: Pasaron por aquí hace tres días. También nos pagaron mucho oro y pociones de sangre solo para impedirles el paso.

source: Would you allow us passage as well, lady vampire? We do not have much gold but we can give you whatever we have.
es: ¿Nos dejarías pasar también, señora vampiro? No tenemos mucho oro, pero podemos darte lo que tengamos.

source: I don't think that will work...
es: No creo que eso funcione…

source: No. We shall fight you if you enter our lands.
es: No. Los combatiremos si entran en nuestras tierras.

source: Minions, kill them and harvest their blood!
es: ¡Esbirros, mátenlos y cosechen su sangre!

source: Lead us to battle, Hikaru!
es: ¡Líderanos a la batalla, Hikaru!

source: Vampires are <i>chaotic</i> with the exception of some having the <i>neutral</i> alignment. It is better to defend during the night time and then retaliate during the day. Do note that the objective is not fighting and defeating the vampires. You should focus on moving your leader to the southern map edge.
es: Los vampiros son <i>caóticos</i>, salvo algunos que tienen alineación <i>neutral</i>. Es mejor defender de noche y contraatacar de día. Recuerda que el objetivo no es pelear ni derrotar a los vampiros. Debes concentrarte en llevar a tu líder al borde sur del mapa.

source: Same vampire units are more attack oriented than others so you should focus on taking down any <i>Blood Apprentices</i> or <i>Blood Hulks</i> if you get the opportunity.
es: Algunas unidades vampiro son más ofensivas que otras, así que enfócate en eliminar cualquier <i>aprendiz de sangre</i> o <i>coloso de sangre</i> si tienes la oportunidad.

source: We have received your message! We are here to help! Let's get that relic back!
es: ¡Recibimos tu mensaje! ¡Vinimos a ayudar! ¡Recuperemos esa reliquia!

source: You can recruit the <i><b>Aragwaith Eagle Riders</b></i> now. These units are capable of moving fast and mostly serve the role of scouts. They have a <i>blade</i> attack as well as an <i>impact</i> attack that is only usable during attacking. Utilize the high mobility and attacking power of these units to flank isolated enemy units and disallow them to retreat.
es: Ahora puedes reclutar <i><b>Jinetes de Águila Aragwaithi</b></i>. Estas unidades se mueven rápido y sirven principalmente como exploradores. Tienen ataque <i>cortante</i> y un ataque <i>de impacto</i> que solo se usa al atacar. Aprovecha su alta movilidad y poder de ataque para flanquear unidades enemigas aisladas e impedir que se retiren.

source: Going further south will lead us deeper into vampire lands. I hope we can find the fortress soon and retrieve the sword.
es: Ir más al sur nos llevará más profundo en tierras de vampiros. Espero que encontremos pronto la fortaleza y recuperemos la espada.

source: <i>(yawns)</i> Hey, what's the big deal? I was napping!
es: <i>(bosteza)</i> Oye, ¿qué pasa? ¡Estaba durmiendo la siesta!

source: Oops, did not mean to interupt. What are you doing in the middle of vampire lands anyways?
es: Ups, no quería interrumpir. ¿Qué hacen en medio de tierras de vampiros, por cierto?

source: I am journeying southwards to meet my elder sister.
es: Estoy viajando al sur para encontrarme con mi hermana mayor.

source: You have a lot of luck to have avoided vampires so long despite being so near their castle.
es: Tienes mucha suerte de haber evitado a los vampiros tanto tiempo estando tan cerca de su castillo.

source: What are you aragwaithi doing here? Should not you all be in the northern kingdoms?
es: ¿Qué hacen unos aragwaithi aquí? ¿No deberían estar todos en los reinos del norte?

source: We are going south to retrieve something that was stolen from us.
es: Vamos al sur a recuperar algo que nos robaron.

source: We share a common path. May I join you in your journey south until I can meet up with my sister?
es: Compartimos camino. ¿Puedo unirme a su viaje al sur hasta que encuentre a mi hermana?

source: I suppose we can. The more the merrier.
es: Supongo que sí. Cuantos más, mejor.

source: Pyrah the <i>Faerie Sprite</i> has joined you!
es: ¡Pyrah la <i>duende hada</i> se ha unido a ti!

source: Curses on you, aragwaith! You may have defeated me, but the other vampire lords will take care of you soon enough.
es: ¡Malditos sean, aragwaith! Puede que me hayan derrotado, pero los otros señores vampiro se encargarán de ustedes pronto.

source: Do not think that you can tread on vampire lands and pass unscatched.
es: No crean que pueden pisar tierras vampiro y salir ilesos.

source: I should have stayed in my tree...
es: Debería haberme quedado en mi árbol…

source: <i>A loud rumbling noise is heard echoing the nearby woods...</i>
es: <i>Se escucha un fuerte ruido retumbar en los bosques cercanos…</i>

source: <i>(belowing)</i> Why have you woken me?
es: <i>(bramando)</i> ¿Por qué me despertaron?

source: Oops! Sorry, we did not mean to disturb your slumber, mighty Wose. We were just passing through.
es: ¡Ups! Perdón, no quisimos molestar tu sueño, poderoso wose. Solo estábamos pasando.

source: You are Aragwaithi. I remember the past well. Your people had helped our people against the dark one eons ago. Tell me, friend, how can this old one be of service?
es: Ustedes son Aragwaithi. Recuerdo bien el pasado. Su pueblo ayudó al nuestro contra el oscuro hace eones. Dime, amigo, ¿cómo puede este viejo servirles?

source: We are trying to rush through these lands to recover something which has been taken from us. Would you you be able to offer any kind of assistance?
es: Estamos intentando atravesar rápido estas tierras para recuperar algo que nos quitaron. ¿Podrías ofrecernos algún tipo de ayuda?

source: Perhaps. Let me awaken the other woses who are slumbering nearby...
es: Tal vez. Déjame despertar a los otros woses que duermen cerca…

source: Hikaru, let us use this opportunity and go across this place as swiftly as possible!
es: ¡Hikaru, aprovechemos esta oportunidad y crucemos este lugar lo más rápido posible!

source: Right.
es: De acuerdo.

source: I see more vampires arriving! We are heavily outnumbered!
es: ¡Veo llegar más vampiros! ¡Estamos en gran desventaja numérica!

source: Fogbound Valley
es: Valle envuelto en niebla

source: Ancient Stones
es: Piedras ancestrales

source: Survive until the end of turns
es: Sobrevivir hasta el final de los turnos

source: Aragwaithi have the terrain advantage on this map.
es: Los Aragwaithi tienen ventaja de terreno en este mapa.

source: Utilize Healing to sustain your units.
es: Utiliza la sanación para mantener a tus unidades.

source: Scenario takes place during the night.
es: El escenario ocurre durante la noche.

source: The fog in this scenario is very thick.
es: La niebla en este escenario es muy espesa.

source: It's a valley.
es: Es un valle.

source: The fog is so thick...I can hardly see anything...
es: La niebla es tan espesa… apenas puedo ver algo…

source: I sense the arrival of warm blood!
es: ¡Siento la llegada de sangre caliente!

source: We shall feast! Minions, attack!
es: ¡Banquetearemos! ¡Esbirros, ataquen!

source: I sense the presence of several vampires!
es: ¡Siento la presencia de varios vampiros!

source: We cannot beat them here. We just have to outlast them until they are forced to retreat...
es: No podemos vencerlos aquí. Solo tenemos que resistir hasta que se vean obligados a retroceder…

source: This scenario takes place entirely during the night. In this scenario, you will learn one key tactic of playing Aragwaiti: playing defensively and striking when the enemy is most vulnerable. The enemy sides will persistently recruit while you may not be able to. You have to recall Aragwaith Adepts and their advancements to provide healing. If you have any Aragwaith Guards or Pikemen, recall them as well.
es: Este escenario ocurre completamente de noche. Aquí aprenderás una táctica clave para jugar con los Aragwaithi: defender y golpear cuando el enemigo esté más vulnerable. Los bandos enemigos reclutarán sin parar mientras tú tal vez no puedas. Debes reincorporar Adeptas Aragwaithi y sus avances para tener sanación. Si tienes Guardias o Piqueros Aragwaithi, reincorpóralos también.

source: Aragwaith units are all <i>neutral</i>, which means they are unaffected by the time of day. Vampire units are either <i>chaotic</i> or <i>neutral</i> which means most of the vampire units will be very strong here. If you see any enemy <i>Blood Apprentices</i> or <i>Blood Hulks</i>, concentrate your attacking power on them to deprive the enemy of using these units.
es: Todas las unidades Aragwaithi son <i>neutrales</i>, por lo que no se ven afectadas por la hora del día. Las unidades Vampiro son <i>caóticas</i> o <i>neutrales</i>, lo que significa que la mayoría serán muy fuertes aquí. Si ves <i>Aprendices de Sangre</i> o <i>Colosos de Sangre</i> enemigos, concentra tu poder de ataque en ellos para privar al enemigo de usarlos.

source: No, I have shamed the Monarchy!
es: ¡No, he avergonzado a la monarquía!

source: To think I would meet my end like this, it's disappointing.
es: Pensar que encontraría mi fin así… es decepcionante.

source: We have defeated them for now. We should rest a bit and proceed southwards.
es: Los derrotamos por ahora. Descansemos un poco y sigamos hacia el sur.

source: I have been recalled this early? What's the situation here?
es: ¿Me reincorporaron tan pronto? ¿Cuál es la situación aquí?

source: There are a lot of vampires here.
es: Hay muchos vampiros aquí.

source: I guess I can help out a bit.
es: Supongo que puedo ayudar un poco.

source: Argh! Fall back for now. They have resisted our offence.
es: ¡Argh! ¡Retírense por ahora! Resistieron nuestro ataque.

source: They seem to be headed where the magic concentration is. I suppose we can let them slip through just this once.
es: Parece que se dirigen hacia donde está la concentración mágica. Supongo que podemos dejarlos pasar solo esta vez.

source: The vampires withdrew from the valley...
es: Los vampiros se retiraron del valle…

source: They have retreated... Let's rest up a bit and persist moving south.
es: Se retiraron… Descansemos un poco y sigamos avanzando al sur.

source: Have some scouts patrol the area to avoid being beset by vampires.
es: Que algunos exploradores patrullen la zona para evitar que los vampiros nos rodeen.

source: Ephemeral Calm
es: Calma efímera

source: Go Home
es: Regresar a casa

source: Advance Further
es: Avanzar más

source: Light Torches
es: Encender antorchas

source: Explore the chamber
es: Explorar la cámara
