Repository: knyghtmare/Electrifyre
Catalog: translations/wesnoth-Electrifyre/*.po
Languages: es

source: Why so, Lord Ryuuma?
es: ¿Por qué, señor Ryuuma?

source: Compared to the size of our intial armies, our numbers have dwindled considerably. What we have right now are the last of our forces.
es: Comparado con el tamaño de nuestros ejércitos iniciales, nuestros números han disminuido considerablemente. Lo que tenemos ahora es lo último de nuestras fuerzas.

source: In comparison, the enemy forces seem to be endless.
es: En comparación, las fuerzas enemigas parecen interminables.

source: This is why I think it is better to find some alternative solution to our current problem.
es: Por eso creo que es mejor encontrar una solución alternativa a nuestro problema actual.

source: My sisters tell me that there is indeed an alternative and more effective way to thwart the enemy.
es: Mis hermanas me dicen que sí existe una forma alternativa y más efectiva de frenar al enemigo.

source: The only way in and out of this fortress for most of their forces is via this massive cave platform. The strange thing is, this platform was not there before. There was giant chasm here.
es: La única forma de entrar y salir de esta fortaleza para la mayoría de sus fuerzas es a través de esta enorme plataforma de cueva. Lo extraño es que esta plataforma no estaba antes. Había un abismo gigante aquí.

source: This surmises that there must be a mechanism controlling the platform being here. You should find and disable the mechanism.
es: Esto indica que debe haber un mecanismo que controla la plataforma. Deben encontrarlo y desactivarlo.

source: That just might work. Let us mobilize our forces!
es: Eso podría funcionar. ¡Movilicemos nuestras fuerzas!

source: This scenario has no turn limit. Slowly build up your force of Aragwaithi veterans and accomplish the scenario objectives at your own pace. If possible, make a save and resume playing from that save file another day if you get exhausted. Drink water and stay hydrated.
es: Este escenario no tiene límite de turnos. Construye lentamente tu fuerza de veteranos aragwaithi y cumple los objetivos del escenario a tu propio ritmo. Si es posible, guarda la partida y continúa jugando desde ese archivo otro día si te cansas. Bebe agua y mantente hidratado.

source: Remember, our allies will be fighting the valefolk head on. It's up to us to find and disable the mechanism!
es: Recuerda, nuestros aliados pelearán contra los habitantes del valle de frente. ¡Nos toca a nosotros encontrar y desactivar el mecanismo!

source: Sisters, let us show these dwarves and their wretched allies that they should not have crossed weapons with us!
es: ¡Hermanas, mostremos a estos enanos y sus miserables aliados que no debieron enfrentarse a nosotras!

source: There will be a lot of ground to cover. Those disabling devices might be anywere.
es: Hay mucho terreno que cubrir. Esos dispositivos de desactivación podrían estar en cualquier parte.

source: We can assist in that regard. Let me do a seeking spell.
es: Podemos ayudar en eso. Déjame hacer un hechizo de búsqueda.

source: The locations of the devices have been revealed!
es: ¡Las ubicaciones de los dispositivos han sido reveladas!

source: Excellent. Now, we know where to coordinate our efforts.
es: Excelente. Ahora sabemos dónde coordinar nuestros esfuerzos.

source: You may have ended me, but no matter what you do, the ritual cannot be interrupted!
es: Pueden haberme eliminado, pero hagan lo que hagan, ¡el ritual no puede ser interrumpido!

source: Ouch! We really should have taken you seriously!
es: ¡Auch! ¡Realmente deberíamos haberte tomado en serio!

source: Curse you, surface-dweller! Da beard of a dwarf is worth more than yer puny life!
es: ¡Maldito habitante de la superficie! ¡La barba de un enano vale más que tu miserable vida!

source: You think this ends it, do ye? Da stones of our halls will weep for ye when ye face the wrath of our kin!
es: ¿Crees que esto termina aquí, verdad? ¡Las piedras de nuestros salones llorarán por ti cuando enfrentes la ira de nuestra raza!

source: It's almost time for the ritual to commence. The other high mages are on their way.
es: Ya casi es hora de comenzar el ritual. Los otros altos magos están en camino.

source: Prietess, do not allow the Aragwaithi or the Deep Elves to disrupt what we are doing no matter the cost.
es: Sacerdotisa, no permitas que los aragwaithi ni los elfos profundos interrumpan lo que estamos haciendo, cueste lo que cueste.

source: Yes, Lady Moirafina! No Aragwaith or Elf shall set foot inside the citadel!
es: ¡Sí, señora Moirafina! ¡Ningún aragwaith ni elfo pondrá un pie dentro de la ciudadela!

source: If I was not required for this ritual, I would have blasted the invaders away with my lightning storms. Anyways, off I go!
es: Si no fuera necesario para este ritual, habría arrasado a los invasores con mis tormentas de relámpagos. ¡En fin, me voy!

source: Do worry, Lord Ojareth. We shall never give in. Our goal shall be realised!
es: No se preocupe, señor Ojareth. ¡Nunca nos rendiremos! ¡Nuestra meta se cumplirá!

source: Are these the ones who had vanquished Laraina? To think they made it all this way, to our very gates. Interesting.
es: ¿Estos son los que vencieron a Laraina? Pensar que llegaron hasta aquí, a nuestras mismas puertas. Interesante.

source: It matters not. Once the master has been unleashed from the magic shackles that have binded him for over a millennium, the descendants of the people who had once incarcerated him, shall be phased out from existence.
es: No importa. Una vez que liberemos al amo de las cadenas mágicas que lo han retenido durante más de un milenio, los descendientes de quienes lo encarcelaron serán borrados de la existencia.

source: Ah, the invaders have come! I shall destroy and deform your corpses to make more of these night creatures!
es: ¡Ah, llegaron los invasores! ¡Destruiré y deformaré sus cadáveres para crear más de estas criaturas nocturnas!

source: Hello, aragwaithi! You are not advancing beyond this point!
es: ¡Hola, aragwaithi! ¡No pasarán de este punto!

source: No passin' 'ere, ya daft git!
es: ¡'Quí no pasa nadie, estúpido!

source: No fur'er, ya big lumps o' meat!
es: ¡Ni un paso má', pedazos 'e carne!

source: The Jinx Beast may not have strong attacks, but the debuffing curse can be deadly to your units. If and when cursed, your main priority should be screen your cursed unit away from enemy reach and let them rest heal in a village which will remove the curse. Alternately, the curse can be cured if the unit is able to advance a level. The Jinx Beast should be countered by strong melee units as not to let them use their ranged special.
es: La Bestia del Maleficio no tiene ataques fuertes, pero su maldición debilitante puede ser mortal para tus unidades. Si una unidad queda maldita, tu prioridad debe ser alejarla del alcance enemigo y dejarla descansar en un pueblo para eliminar la maldición. También se cura si la unidad sube de nivel. La Bestia Maldita debe enfrentarse con unidades fuertes de cuerpo a cuerpo para evitar que use su ataque especial a distancia.

source: The Cloud of Gloom is mostly a ranged focused damage dealer with the terror ability. It's rather challenging to take down due to the reduced damage dealt by your units. A recommended counter is to use a decidicated melee damage level 3 unit such as the Aragwaith Swordsmaster, Slayer or Guardian. Alternately, using the leadership ability from a Captain, or even better, an Ancient Banner to counter the debuffing ability.
es: La Nube de Penumbra es principalmente un atacante a distancia con la habilidad de terror. Es difícil de eliminar por el daño reducido que reciben tus unidades. Un buen contraataque es usar una unidad de nivel 3 de daño cuerpo a cuerpo como el maestro espadachín, asesino o guardián aragwaithi. También puedes contrarrestar su habilidad debilitante usando liderazgo de un capitán o, mejor aún, un estandarte ancestral.

source: The Soul Snatcher can be assumed as a tanky spectral or ghostlike unit. They can use drain and deal arcane damage. A recommended and effective counter is the ranged attack of Aragwaith Enchantresses or Aragwaith Sorceresses.
es: El Robaalmas es una unidad espectral o fantasmal muy resistente. Usa drenaje y daño arcano. Un contraataque recomendado y efectivo es el ataque a distancia de Encantadoras o Hechiceras Aragwaithi.

source: The Angry One is sturdy and is strong in melee. Normally archer or mage class units can deal with this unit effectively.
es: El Enojado es resistente y fuerte en cuerpo a cuerpo. Normalmente arqueros o unidades de clase mago pueden eliminarlo eficazmente.

source: The Rash One has a melee attack with the charge weapon special. The recommended tactic is to expose this unit to ranged damage dealers or mitigate its charging attack with a strong defensive unit like the Aragwaith Shield Guard.
es: El Impetuoso tiene un ataque cuerpo a cuerpo con carga. La táctica recomendada es exponerlo a atacantes a distancia o mitigar su carga con una unidad defensiva fuerte como el guardia con escudo aragwaithi.

source: The Shredder Spawn is a terrifying enemy. It has the frenzy and drain weapon specials in its melee attack, making it deadly and self-sustaining. You can choose to take this unit down with your Strongbows, Enchantresses; or challenge it in melee with an Aragwaith Pikeman or Guardian; or, even better, a combination of the two.
es: El Engendro Triturador es un enemigo terrorífico. Tiene frenesí y drenaje en su ataque cuerpo a cuerpo, lo que lo hace letal y autosostenible. Puedes eliminarlo con Arcos Fuertes o Encantadoras; enfrentarlo en cuerpo a cuerpo con un piquero o guardián aragwaithi; o, mejor aún, con una combinación de ambos.

source: Oi! You bloody trespassers! This here's a prison, not a playground! Get outta here before I shove a spear up yer...
es: ¡Hey! ¡Malditos intrusos! ¡Esto es una prisión, no un parque de juegos! ¡Lárguense antes de que les meta una lanza por el…

source: Hey, there is this narrow passage here that goes somewhere. This might be worth investigating.
es: Oye, hay un pasaje estrecho aquí que lleva a algún lado. Vale la pena investigarlo.

source: Well, this has led to a large mud pool. I do not see anything interesting here...
es: Bueno, esto lleva a un gran charco de barro. No veo nada interesante aquí…

source: No, wait...I see a glowing blue sphere!
es: ¡Espera… veo una esfera azul brillante!

source: Miiiinnnneee!
es: ¡Miiiiiiooooo!

source: Not for long!
es: ¡No por mucho tiempo!

source: Thank you, noble Aragwaithi. I am in your debt. Let me heal up and I shall lend my aid in this battle.
es: Gracias, nobles aragwaithi. Estoy en deuda con ustedes. Dejad que me cure y prestaré mi ayuda en esta batalla.

source: Thank you, noble Aragwaithi. I shall lend you my expertise in this battle.
es: Gracias, nobles aragwaithi. Les prestaré mi experiencia en esta batalla.

source: Thanks. Now, tell me who needs to be smashed!
es: Gracias. Ahora, ¡decidme a quién hay que aplastar!

source: Grashen! Verra! You guys have been freed as well!
es: ¡Grashen! ¡Verra! ¡A ustedes también los liberaron!

source: Yes, and it is all thanks to these noble aragwaithi. I have heard stories of your people and you have lived to the stories! Haha!
es: Sí, y todo es gracias a estos nobles aragwaithi. Había oído historias sobre su pueblo ¡y han estado a la altura de ellas! ¡Ja ja!

source: We wish to head back home to the Everflame Maw. However, to thank you for freeing us, we shall all assist in this fight.
es: Queremos regresar a casa, al Abismo de la Llama Eterna. Sin embargo, para agradecerles que nos liberaran, todos ayudaremos en esta lucha.

source: This passageway leads into a bigger cavern. I think we might find one of the devices at the end of it.
es: Este pasadizo lleva a una caverna más grande. Creo que podríamos encontrar uno de los dispositivos al final.

source: A passageway...perhaps one of the devices might be up ahead?
es: Un pasadizo... ¿tal vez uno de los dispositivos esté más adelante?

source: I think we can find one of the devices if we follow this tunnel.
es: Creo que podemos encontrar uno de los dispositivos si seguimos este túnel.

source: This passage might lead to one of the devices.
es: Este pasaje podría conducir a uno de los dispositivos.

source: Hikaru, advancing our forces beyond this point appears to be a pointless endeavour. The valefolk fortifications are too strong for us to overcome with our current strength.
es: Hikaru, avanzar nuestras fuerzas más allá de este punto parece un esfuerzo inútil. Las fortificaciones de los valefolk son demasiado fuertes para superarlas con nuestra fuerza actual.

source: Agreed. We should focus on finding the devices that are keeping this cave platform risen.
es: De acuerdo. Deberíamos concentrarnos en encontrar los dispositivos que mantienen elevada esta plataforma de la caverna.

source: I think that did the trick! Everyone get yourselves away from the cave platform right now!
es: ¡Creo que funcionó! ¡Todos aléjense de la plataforma de la caverna ahora mismo!

source: Epilogue
es: Epílogo

source: Wow, the Royal Gardens! It has been ages since I have been here. The last time I was here, it was during our graduation party. It seemed to have gotten even more magnificent than last time!
es: ¡Guau, los Jardines Reales! Hace muchísimo que no venía aquí. La última vez fue durante la fiesta de graduación. ¡Parecen aún más magníficos que entonces!

source: I see veteran soldiers up ahead. I wonder what the occassion is.
es: Veo soldados veteranos más adelante. Me pregunto qué ocasión será.

source: Hello, there! My name is Hikaru...
es: ¡Hola! Mi nombre es Hikaru...

source: Ah, yes. You are that swordsman from Miyamura Village.
es: Ah, sí. Tú eres aquel espadachín del pueblo Miyamura.

source: Your Highness! Forgive my...
es: ¡Alteza! Perdone mi...

source: Haha, no need for the formalities.
es: Ja ja, no hacen falta las formalidades.

source: Now, to address significant topics. Hikaru, do you know why I have summoned you here?
es: Ahora, a temas importantes. Hikaru, ¿sabes por qué te he hecho llamar?

source: I am afraid not, Your Highness.
es: Me temo que no, Alteza.

source: I am organizing a grand expedition and it will be a collaborative effort. Not just the Aragwaithi, but the Windsong of the Farthest North, the Deep Elves of the Irdyan Depths, the Drakes of the Everflame Maw, and some orcish tribes will also be participants.
es: Estoy organizando una gran expedición y será un esfuerzo conjunto. No solo los aragwaithi, sino también las Hijas del Viento del lejano norte, los elfos profundos de las Profundidades Irdyan, los dracos del Abismo de la Llama Eterna y algunas tribus orcas también participarán.

source: Now, for my legions, I have four marshals and twelve captains acting as coordinating leaders of the massive expeditionary force. Lord Ryuuma is one of the four marshals. When I asked him if he knew any good captains who would fit in perfectly for this grand mission, he has recommended you.
es: Para mis legiones, tengo cuatro mariscales y doce capitanes que actuarán como líderes coordinadores de la enorme fuerza expedicionaria. El señor Ryuuma es uno de los cuatro mariscales. Cuando le pregunté si conocía algún capitán adecuado para esta gran misión, él te recomendó.

source: I know you are not a Captain and just command the militia force of your village. However, Lord Ryuuma has seen a potential in you to be something more. Considering this, I am willing to immediately promote you as a Captain and have you take on the assignment.
es: Sé que no eres capitán y solo comandás la milicia de tu aldea. Sin embargo, el señor Ryuuma ha visto en ti el potencial para ser algo más. Por eso, estoy dispuesto a ascenderte inmediatamente a capitán y darte la misión.

source: I would be honored, Your Highness.
es: Sería un honor, Alteza.

source: Excellent. The expedition does not begin until the dawn of the coming year, so I suggest you return to your village to say your farewells, handpick some trusted veterans to join you and return here for the initiation and follow up formalities.
es: Excelente. La expedición no comienza hasta el amanecer del año próximo, así que te sugiero regresar a tu aldea para despedirte, elegir algunos veteranos de confianza que te acompañen y volver aquí para la ceremonia de inicio y los trámites posteriores.

source: I will do so, Your Highness. May I inquiry why we are organizing such an enterprise?
es: Así lo haré, Alteza. ¿Puedo preguntar por qué organizamos una empresa de esta magnitud?

source: I cannot really share much details about it. However, young Hikaru, I shall tell you this: a powerful storm is brewing...
es: No puedo revelar muchos detalles al respecto. Sin embargo, joven Hikaru, te diré esto: se está gestando una tormenta poderosa...

source: Cliffs (facing N)
es: Barrancos (mirando al norte)

source: Cliffs (facing S)
es: Barrancos (mirando al sur)

source: race^Valefolk Human
es: Humano valeano

source: race^Valefolk Humans
es: Humanos valeanos

source: Having once been one of the prominent civilisations in Argea (the Old Continent), the Valefolk have now been weakened due to constant war with the Orcs and Minotaurs and restricted to residing in secluded regions. The Valefolk are an honorable people, being the ancestors of the Green Isle humans.
es: Habiendo sido alguna vez una de las civilizaciones más destacadas de Argea (el Continente Antiguo), los valeanos se han debilitado por las guerras constantes contra los orcos y los minotauros, y ahora están restringidos a vivir en regiones apartadas. Los valeanos son un pueblo honorable, ancestros de los humanos de la Isla Verde.

source: Luminous Stone
es: Piedra Luminosa

source: A strange floating stone illuminating the surroundings.
es: Una extraña piedra flotante que ilumina los alrededores.

source: Attacker Conduit
es: Conducto Atacante

source: This thing is impossible to describe, no one has seen anything like it before.
es: Esta cosa es imposible de describir, nadie ha visto nada parecido antes.

source: energy ray
es: rayo de energía

source: Defender Conduit
es: Conducto Defensor

source: A strange obelisk...
es: Un extraño obelisco...

source: Supply Caravan
es: Caravana de suministros

source: Caravans are used to carry gold or supplies long distances. Because of the immense weight of the cargo this caravan carries, it is not nimble, but the driver can still try to drive off attackers with his whip.
es: Las caravanas se usan para transportar oro o suministros a largas distancias. Debido al peso inmenso de la carga que lleva esta caravana, no es ágil, pero el conductor aún puede intentar ahuyentar a los atacantes con su látigo.

source: The length of this unit’s improvised weapon allows it to strike first in defensive melee, but it cannot use it to attack.
es: La longitud del arma improvisada de esta unidad le permite golpear primero en combate cuerpo a cuerpo defensivo, pero no puede usarla para atacar.

source: whip
es: látigo

source: deterrent strike
es: golpe disuasorio

source: This unit always strikes first with this attack if they are defending, but cannot attack with it at all.
es: Esta unidad siempre golpea primero con este ataque si está defendiendo, pero no puede atacar con él en absoluto.

source: Abomination
es: Abominación

source: However they came into existence, they appear to be highly sensitive to light and avoid leaving the safety of their dark caverns.
es: Sea como fuere que llegaron a existir, parecen ser muy sensibles a la luz y evitan abandonar la seguridad de sus cavernas oscuras.

source: crush
es: aplastar

source: Cursed Spearbearer
es: Portalanza maldito

source: TODO
es: POR HACER

source: spear
es: lanza

source: Prong Bug
es: Bicho cornudo

source: fangs
es: colmillos

source: Vale Archer
es: Arquero del Valle

source: frost arrow
es: flecha de escarcha

source: bow
es: arco

source: Vale Assassin
es: Asesino del Valle

source: blade
es: cuchilla

source: staff
es: bastón

source: darts
es: dardos

source: Vale Follower
es: Seguidora del Valle

source: aura blast
es: estallido de aura

source: Vale Horseman
es: Jinete del Valle

source: sword
es: espada

source: Vale Scout
es: Explorador del Valle

source: Vale Sentinel
es: Centinela del Valle

source: Vale Avenger
es: Vengador del Valle

source: composite bow
es: arco compuesto

source: Vale Crossbowman
es: Ballestero del Valle

source: crossbow
es: ballesta

source: Vale Slayer
es: Matador del Valle

source: Vale Priestess
es: Sacerdotisa del Valle

source: Vale Captain
es: Capitán del Valle

source: Vale Rider
es: Caballista del Valle

source: Vale Purifier
es: Purificador del Valle

source: white sword
es: espada blanca

source: Vale Windblade
es: Hoja de Viento del Valle

source: longsword
es: espada larga
