Repository: knyghtmare/Electrifyre
Catalog: translations/wesnoth-Electrifyre/*.po
Languages: es

source: Try to solve the puzzle.
es: Intentar resolver el rompecabezas.

source: There is no combat in this scenario.
es: No hay combate en este escenario.

source: Hikaru and Soryu have unlimited movement here.
es: Hikaru y Soryu tienen movimiento ilimitado aquí.

source: You cannot end your turn.
es: No puedes terminar el turno.

source: You cannot end your turn until you taken an action.
es: No puedes terminar el turno hasta que realices una acción.

source: Ah, Hikaru. Thank you for answering my summons.
es: Ah, Hikaru. Gracias por responder a mi llamado.

source: Always, Lord Ryuuma!
es: ¡Siempre, señor Ryuuma!

source: After the battle, we have searched the castle fortress and found this chamber of sorts. Now, this chamber appears to have two paths: one seems to lead further underground and other is locked by a gate.
es: Después de la batalla, registramos la fortaleza y encontramos esta especie de cámara. Parece tener dos caminos: uno lleva más bajo tierra y el otro está cerrado con una puerta.

source: We have tried to force open that second gate but there seems to be some sort of mechanism involved to its opening.
es: Intentamos forzar esa segunda puerta, pero parece que hay algún tipo de mecanismo para abrirla.

source: Now, Hikaru. I see that the forces you have brought along have seen their fair share of battle. I do have sufficient forces to progress with the mission but I would appreciate the assistance if you can spare any. Thus, I present you a choice: you can go back home or you can continue onwards with us. No need to rush this. Take your time. Explore a bit, try the mechanism out, or proceed down the tunnel to advance further.
es: Ahora, Hikaru. Veo que las fuerzas que trajiste han pasado por muchas batallas. Yo tengo suficientes tropas para continuar la misión, pero agradecería tu ayuda si puedes brindarla. Te doy una opción: puedes regresar a casa o seguir adelante con nosotros. No hay prisa. Tómate tu tiempo. Explora un poco, prueba el mecanismo o avanza por el túnel.

source: Thank you, Lord Ryuuma, we shall make a decision soon.
es: Gracias, señor Ryuuma. Pronto tomaremos una decisión.

source: Hey, wait!
es: ¡Oye, espera!

source: Yes?
es: ¿Sí?

source: If you are going down this path, there is a chamber with some sort of mechanism involving torches.
es: Si van por este camino, hay una cámara con un mecanismo que involucra antorchas.

source: We have been trying for quite some time, but the puzzle seems complex. I wish you luck if you choose to have a go at it yourself.
es: Llevamos un buen rato intentándolo, pero el rompecabezas parece complicado. Te deseo suerte si decides probarlo tú mismo.

source: Lord Ryuuma and the rest seem convinced to take the open path.
es: El señor Ryuuma y los demás parecen decididos a tomar el camino abierto.

source: Thanks for letting us know. Let's see if we can solve it some way.
es: Gracias por avisarnos. Veamos si podemos resolverlo de alguna forma.

source: NOT IMPLEMENTED YET
es: AÚN NO IMPLEMENTADO

source: Let us take this open path!
es: ¡Tomemos este camino abierto!

source: Wise choice, Hikaru. We do not know what we will face down there but we shall combat this situation together. Now, onwards!
es: Buena elección, Hikaru. No sabemos qué enfrentaremos allá abajo, pero lo combatiremos juntos. ¡Ahora, adelante!

source: Forfeit Campaign
es: Abandonar la campaña

source: Would you like to abandon this quest and go home?
es: ¿Quieres abandonar esta misión y regresar a casa?

source: We shall be heading home, Lord Ryuuma.
es: Regresaremos a casa, señor Ryuuma.

source: A safe choice. I wish you a safe journey, my young friends.
es: Una decisión segura. Les deseo un viaje seguro, jóvenes amigos.

source: Premature Ending
es: Final prematuro

source: The Mage and the Sword
es: El mago y la espada

source: Lady Laraina
es: Señora Laraina

source: spectral barrier
es: barrera espectral

source: This unit is manifesting a spectral barrier around itself which makes them nearly invulnerable to almost all damage types. Only electric weapons can penetrate the barrier.
es: Esta unidad está manifestando una barrera espectral a su alrededor que la hace casi invulnerable a casi todos los tipos de daño. Solo las armas eléctricas pueden atravesar la barrera.

source: Retrieve the Electrifyre
es: Recuperar la Electryfire

source: Defeat the leader of the Mages and Dwarves
es: Derrotar al líder de los magos y enanos

source: Find Pyrah's sister
es: Encontrar a la hermana de Pyrah

source: Death of Ryuuma
es: Muerte de Ryuuma

source: Try to enter the castle from a side-route.
es: Intenta entrar al castillo por un camino lateral.

source: Recall an Aragwaith Enchantress or Sorceress.
es: Reincorpora una Encantadora o una Hechicera Aragwaithi.

source: Recall infantry class veterans.
es: Reincorpora veteranos de infantería.

source: Only Electrifyre can damage the Mage Lord.
es: Solo la Electryfire puede dañar al Señor Mago.

source: Hikaru, the southern trail ends here!
es: ¡Hikaru, el sendero del sur termina aquí!

source: There seems to be a castle up ahead. I sense a great magic power inside the castle.
es: Parece que hay un castillo más adelante. Siento un gran poder mágico dentro del castillo.

source: We should proceed with caution. We cannot let Electrifyre fall into the wrong hands. It must be returned to its shrine!
es: Debemos avanzar con cuidado. No podemos permitir que la Electryfire caiga en manos equivocadas. ¡Tiene que volver a su santuario!

source: Hello, fellow kinsmen. What brings you here?
es: Hola, compatriotas. ¿Qué los trae por aquí?

source: Our village had been robbed of its relic, and we are here to take it back.
es: Nos robaron la reliquia del pueblo y vinimos a recuperarla.

source: Another village has also been plundered for a long-forgotten relic? I was dispatched here from the Royal Capital to investigate and put a stop to these crimes. Let us unite our forces and take down these enemies!
es: ¿Otro pueblo saqueado por una reliquia olvidada hace mucho? Me enviaron desde la capital real para investigar y detener estos crímenes. ¡Unamos nuestras fuerzas y acabemos con estos enemigos!

source: Of course!
es: ¡Por supuesto!

source: Your ally will keep the enemy engaged outside the fortress. What you have to do is form an initial group of veteran units and inflitrate (sneak into) the fortress from one of the side passages.
es: Tu aliado mantendrá al enemigo ocupado fuera de la fortaleza. Lo que debes hacer es formar un grupo inicial de unidades veteranas e infiltrarse (entrar sigilosamente) en la fortaleza por uno de los pasajes laterales.

source: You should be able to utilise the tactics on playing Aragwaithi from the previous scenario is this battle such using Guards and Pikemen as damage absorbers or using Adepts or Enchantresses to heal. It is recommended to avoid recalling any flying or scout units as you have to rely on infantry-based and healing units.
es: Puedes usar las tácticas de jugar con Aragwaithi de los escenarios anteriores: usa Guardias y Piqueros como escudos que absorban daño o Adeptas y Encantadoras para sanar. Se recomienda no reincorporar unidades voladoras ni exploradores, ya que dependerás de unidades de infantería y curación.

source: Lord Knight, may I know your name?
es: Señor caballero, ¿puedo saber su nombre?

source: I am Ryuuma of House Shimotsuki
es: Soy Ryuuma de la Casa Shimotsuki.

source: House Shimotsuki?!
es: ¡¿Casa Shimotsuki?!

source: Are you really..?
es: ¿De verdad eres…?

source: Yes, I am the very same. I sometimes do feel my feats in that war are a bit exaggerated though.
es: Sí, soy el mismo. A veces siento que mis hazañas en esa guerra están un poco exageradas.

source: Hikaru, try taking your band and infiltrate the castle from a side passage. We shall keep the main enemy force distracted outside.
es: Hikaru, lleva a tu grupo e infíltrate en el castillo por un pasaje lateral. Nosotros mantendremos distraída a la fuerza enemiga principal afuera.

source: As you command, Lord Ryuuma!
es: ¡Como ordenes, Señor Ryuuma!

source: What do we have here? Have you come to retrieve the relics I requisitioned from you?
es: ¿Qué tenemos aquí? ¿Vinieron a recuperar las reliquias que les requisé?

source: I do not know why you stole so many relics from the villages and towns, but I shall ensure you return all of them!
es: No sé por qué robaron tantas reliquias de pueblos y ciudades, ¡pero me encargaré de que las devuelvan todas!

source: You're too late, knight. I already sent over most of them. Just a recently stolen one is left.
es: Llegaron tarde, caballero. Ya envié la mayoría. Solo queda una que robamos hace poco.

source: That must be the Electrifyre! Quick, we must retrieve it!
es: ¡Esa debe ser la Electryfire! ¡Rápido, tenemos que recuperarla!

source: Focus on that mage leader! She must be brought to justice!
es: ¡Concéntrense en esa líder maga! ¡Tiene que rendir cuentas!

source: If you check the resistances of the enemy leader, you can see that only <i>electric</i> damage attacks can hurt her. Check out the nearby locations, there might be some relic/artifact which can give you this damage type attack.
es: Si revisas las resistencias de la líder enemiga, verás que solo los ataques de daño <i>eléctrico</i> la hieren. Busca en los lugares cercanos: puede haber alguna reliquia o artefacto que dé ese tipo de daño.

source: Hey, wait! I see humans here!
es: ¡Oye, espera! ¡Veo humanos aquí!

source: Wow! They must be from the Vale!
es: ¡Vaya! ¡Deben ser habitantes del valle!

source: You, there. Why have you aligned with the mages?
es: Ustedes ahí. ¿Por qué se aliaron con los magos?

source: We have been ordered by the Leadership to assist the mages in their objectives. You shall not hinder us!
es: El liderazgo nos ordenó ayudar a los magos en sus objetivos. ¡No nos estorben!

source: If you are not a friend, then you are a foe. I suggest you prefer to fight then.
es: Si no son amigos, son enemigos. Les sugiero que prefieran pelear.

source: It's a shame they are not friendly. I had many questions I wished to ask.
es: Qué lástima que no sean amistosos. Tenía muchas preguntas que quería hacerles.

source: The Valefolk have not been seen since the Argean War, which had occured nearly 200 years ago. It makes me wonder what they are doing here of all places.
es: A los habitantes del valle no se los ha visto desde la Guerra de Argea, hace casi 200 años. Me pregunto qué hacen aquí, de todos los lugares.

source: The Valefolk was a sub-faction of humans, like the Aragwaithi. Almost all their units have the <i>liminal</i> alignment. One key observation is that all their advancement trees end at the second level (<b>level 2</b>).
es: Los habitantes del valle eran una subfacción humana, como los Aragwaithi. Casi todas sus unidades tienen alineación <i>crepuscular</i>. Un detalle importante es que sus líneas de avance terminan en nivel 2.

source: Such weapons cannot wound me, fools! Do you think, I, one of the seven mage masters will fall to such pathetic attempts?
es: ¡Esas armas no pueden herirme, idiotas! ¿Creen que yo, una de las siete maestras magas, caeré ante intentos tan patéticos?

source: Hmm, she seems to be protected by a magical shield. Maybe we can find something inside the castle that can dissipate it. Quickly, search!
es: Hmm, parece estar protegida por un escudo mágico. Tal vez encontremos algo dentro del castillo que lo disipe. ¡Rápido, busquen!

source: It seems striking her with the Electrifyre distorts the barrier she has been using! This seems to be the key to defeating her!
es: ¡Parece que golpearla con la Electryfire distorsiona la barrera que usa! ¡Esta parece ser la clave para derrotarla!

source: <i>(launches a ferociously skilled slash)</i> Take that!
es: <i>(lanza un corte feroz y experto)</i> ¡Toma eso!

source: Argh! This weapon... My barrier has been broken!
es: ¡Argh! ¡Esta arma… Mi barrera está rota!

source: Well done, everyone!
es: ¡Bien hecho, todos!

source: Hey, wait! I know this place!
es: ¡Oye, espera! ¡Conozco este lugar!

source: Have you been here before, Pyrah?
es: ¿Habías estado aquí antes, Pyrah?

source: Well, yeah. This is where I am supposed to be! My sister is somewhere here, probably, taking refuge in a tree somewhere. I should find her.
es: Pues sí. ¡Aquí es donde debo estar! Mi hermana está por aquí, probablemente refugiada en algún árbol. Tengo que encontrarla.

source: Oh, my...this tree...
es: Oh, Dios… este árbol…

source: This is it! This is the tree!
es: ¡Este es! ¡Este es el árbol!

source: Wait, this is the place you were looking for?
es: Espera, ¿este es el lugar que buscabas?

source: Have you found your sister yet?
es: ¿Ya encontraste a tu hermana?

source: She must be here. She is probably asleep. Let me try calling her!
es: Debe estar aquí. Seguro está dormida. ¡Déjame llamarla!

source: Ugh. Let me sleep...
es: Ugh… déjame dormir…

source: Pyrah? Pyrah! You are finally here!
es: ¿Pyrah? ¡Pyrah! ¡Al fin llegaste!

source: Yes! Now, we can resume our jounrey!
es: ¡Sí! ¡Ahora podemos continuar nuestro viaje!

source: Yes, we can.
es: Sí, podemos.

source: (to Hikaru and the Aragwaithi)
es: (a Hikaru y los Aragwaithi)

source: Thank you for guiding my sister to me. Before we resume our journey to the sacred grove, I would like to bestow you upon my boon. I hope that makes up for my sister leaving your party.
es: Gracias por guiar a mi hermana hasta mí. Antes de continuar nuestro viaje al bosquecillo sagrado, quiero otorgarles mi bendición. Espero que compense que mi hermana deje su grupo.

source: Staff of the Sorceress
es: Bastón de la hechicera

source: Crafted from flawless ivory, the staff gleamed like a polished bone. Its surface, untouched by a single mark, held the chill of a mountain peak. A single, pearlescent orb pulsed at its tip, a heart of magic waiting to be ignited by a destined touch.
es: Tallado en marfil perfecto, el bastón brillaba como hueso pulido. Su superficie, sin una sola marca, guardaba el frío de una cima montañosa. Un único orbe perlado pulsaba en la punta, un corazón de magia esperando ser encendido por un toque destinado.

source: <span fgcolor='grey'><b>Add <i>slows</i> special for ranged attack.</b></span>
es: <span fgcolor='grey'><b>Agrega la habilidad especial <i>ralentiza</i> al ataque a distancia.</b></span>

source: Only an Aragwaith Enchantress or Sorceress can equip this artfiact!
es: ¡Solo una Encantadora o Hechicera Aragwaithi puede equipar este artefacto!

source: Farewell! Hope we meet again someday!
es: ¡Adiós! ¡Espero que nos volvamos a ver algún día!

source: Hey! I found Electrifyre! It's here! Hikaru, come quick! Take it!
es: ¡Oye! ¡Encontré la Electryfire! ¡Está aquí! ¡Hikaru, ven rápido! ¡Tómala!

source: Hey, I found a keep! I can rally some more soldiers in this battle from here!
es: ¡Oye, encontré un torreón! ¡Puedo reunir más soldados para esta batalla desde aquí!

source: Haha! My teleportation is complete!
es: ¡Ja ja! ¡Mi teletransportación está completa!

source: The pesky mage has escaped! Who knows more she has stolen from us!
es: ¡El maldito mago ha escapado! ¡Quién sabe cuánto más nos robó!

source: We have failed this mission...
es: Hemos fracasado en esta misión…

source: Forsaken Hall
es: Salón abandonado

source: saurians
es: saurios

source: Undead
es: No muertos

source: Find a way to defeat the Jinn
es: Encontrar una forma de derrotar al Jinn

source: There are no villages in this scenario.
es: No hay aldeas en este escenario.

source: You cannot attack the Jinn directly.
es: No puedes atacar directamente al Jinn.

source: You can control Ryuuma via right-click options on any reachable hex.
es: Puedes controlar a Ryuuma con clic derecho en cualquier casilla alcanzable.

source: Obelisk
es: Obelisco

source: Lord Ryuuma, I see an opening up ahead.
es: Señor Ryuuma, veo una abertura más adelante.

source: Let me be the vanguard. My shield can block any surprise attacks.
es: Déjame ser la vanguardia. Mi escudo puede bloquear cualquier ataque sorpresa.

source: A doorway and its open. Leads to a big chamber.
es: Una puerta abierta. Lleva a una cámara grande.

source: Woah! Watch your step, everyone! There is a chasm here.
es: ¡Cuidado! ¡Cuidado con el paso! ¡Hay un abismo aquí!

source: Another chasm. Might be worthwhile having an eagle rider scout out this chamber a bit.
es: Otro abismo. Valdría la pena que un jinete de águila explore un poco esta cámara.

source: Excellent. Two keeps. We can rally our forces here if the need arises. Take the other keep, Hikaru.
es: Excelente. Dos torreones. Podemos reunir nuestras fuerzas aquí si es necesario. Toma el otro torreón, Hikaru.

source: I am in position.
es: Estoy en posición.

source: Okay, we are in position! Let's rally our troops and press forward...
es: ¡Bien, estamos en posición! ¡Reunamos nuestras tropas y avancemos…

source: What's happening? The gates have closed!
es: ¿Qué pasa? ¡Las puertas se cerraron!

source: We cannot turn back now!
es: ¡Ya no podemos retroceder!

source: Did we trigger a trap or something?
es: ¿Activamos una trampa o algo?

source: Stand firm, everyone!
es: ¡Manténganse firmes, todos!

source: Welcome, exalted guests! I am Xul'thar, an entity from a bygone era.
es: ¡Bienvenidos, ilustres invitados! Soy Xul'thar, una entidad de una era olvidada.

source: I am Ryuuma Shimotsuki of the Aragwaithi and these are brave soldiers and mages in my regiment. We seek passage further into the depths.
es: Soy Ryuuma Shimotsuki de los aragwaithi y estos son valientes soldados y magos de mi regimiento. Buscamos paso hacia las profundidades.

source: I am thrilled to make your acquaintance. Now, we shall begin!
es: Me emociona conocerlos. ¡Ahora, comenzaremos!

source: What? What do you mean by that?
es: ¿Qué? ¿Qué quieres decir con eso?

source: Is not it obvious? You all carelessly step into my realm and except to walk out of here unscathed? Hardly!
es: ¿No es obvio? Todos entraron descuidadamente en mi dominio y esperan salir ilesos. ¡Difícil!

source: The objective is simple. You will battle and face my minions and make some paltry attempt to vanquish me, where as, I shall watch your endeavours and eventual failure. Then, I am entertained and will reset the chamber to repeat the cycle.
es: El objetivo es simple. Lucharán contra mis esbirros e intentarán vencerme, mientras yo observo sus esfuerzos y su fracaso final. Luego, me entretengo y reinicio la cámara para repetir el ciclo.

source: Does that not sound entertaining? It's different every time and I enjoy it every time!
es: ¿No suena entretenido? Cada vez es diferente y lo disfruto cada vez.

source: Oh, no! It's a crazed Jinn!
es: ¡Oh, no! ¡Es un jinn loco!

source: I refuse to accept such a fate. Maybe we can make a different outcome. We have to try!
es: Me niego a aceptar ese destino. Tal vez podamos cambiar el resultado. ¡Tenemos que intentarlo!

source: Hikaru speaks wisdom. We shall not succumb to the odds regardless of how overwhelming they might be. Now, prepare for battle!
es: Hikaru habla con sabiduría. No nos rendiremos sin importar lo abrumadoras que sean las probabilidades. ¡Ahora, prepárense para la batalla!

source: There is no way to attack the Jinn directly. You must explore the chamber and discover some alternate way to defeat the Jinn.
es: No hay forma de atacar directamente al jinn. Deben explorar la cámara y descubrir alguna otra manera de derrotarlo.

source: Foes come at us from all directions. At least we have keeps to rally our soldiers from.
es: Los enemigos nos atacan desde todas partes. Al menos tenemos torreones para reunir a nuestros soldados.

source: You forget one thing...I control everything in this space!
es: Olvidan una cosa… ¡yo controlo todo en este espacio!

source: Chants indiscernable black speech
es: Canta en lengua negra ininteligible

source: Oh, no! The keeps!
es: ¡Oh, no! ¡Los torreones!

source: Do not fret! We can win this with whatever forces we have on the field currently!
es: ¡No se preocupen! ¡Podemos ganar esto con las fuerzas que tenemos en el campo ahora!

source: Your keeps are now gone and you must win with the units you have on the map currently.
es: Ya no tienes torreones y debes ganar con las unidades que tienes actualmente en el mapa.

source: Ouch! That hurts!
es: ¡Auch! ¡Eso duele!

source: Destroying that pillar caused the Jinn to take damage!
es: ¡Destruir ese pilar hizo daño al jinn!

source: Maybe we have to find and destroy more of these obelisks!
es: ¡Tal vez tengamos que encontrar y destruir más de estos obeliscos!

source: Curses on you!
es: ¡Malditos sean!

source: Destroying a second pillar brought the Jinn's lifepoints to half! Just two more and we can win this!
es: ¡Destruir un segundo pilar bajó a la mitad la vida del jinn! ¡Solo faltan dos más y ganamos!

source: Ouch! That hurts a lot!
es: ¡Auch! ¡Eso duele mucho!

source: That's three! One more and we can defeat this Jinn!
es: ¡Son tres! ¡Uno más y derrotamos a este jinn!

source: I cannot believe this!
es: ¡No puedo creer esto!

source: All four obelisks have been destroyed! Great work, everyone!
es: ¡Los cuatro obeliscos han sido destruidos! ¡Gran trabajo, todos!

source: Did we win?
es: ¿Ganamos?

source: The entrance gates have opened!
es: ¡Las puertas de entrada se abrieron!

source: The jinn has been suppresed. We should resume our advance right away. It would be gravely exhausting if he came back to harass us once again.
es: El jinn ha sido suprimido. Debemos reanudar el avance de inmediato. Sería muy agotador si vuelve a molestarnos otra vez.

source: I wonder who that jinn was? He seemed really powerful.
es: Me pregunto quién era ese jinn. Parecía realmente poderoso.

source: Strong jinn like him existed during the First Elemental War. All of them were once created by the Dark One. Once he was sealed away, the Jinn were freed from servitude and did as they pleased. This one probably made this cavern and decided to play a death game with whoever showed up.
es: Jinns poderosos como él existieron durante la Primera Guerra Elemental. Todos fueron creados por el Oscuro. Cuando fue sellado, los jinns quedaron libres y hicieron lo que quisieron. Este probablemente creó esta caverna y decidió jugar a un juego mortal con quien apareciera.

source: I hope we gave the jinn his final rest then.
es: Espero que le hayamos dado su descanso final.

source: I hope so as well. Now, we must proceed further.
es: Eso espero también. Ahora debemos seguir adelante.

source: Hey, I can see that we can effectively navigate this place with our eagles!
es: ¡Oye, veo que podemos movernos bien por aquí con nuestras águilas!

source: Excellent thinking! We can have eagle riders scout and identify any potential methods of suppressing the Jinn!
es: ¡Excelente idea! ¡Los jinetes de águila pueden explorar y encontrar formas de suprimir al jinn!

source: Leave it to us, Lord Ryuuma!
es: ¡Déjenoslo a nosotros, señor Ryuuma!

source: <i>Eagle Riders</i> and <i>Eagle Masters</i> will be pivotable for this scenario. You may recruit/recall more but it is best if you keep your army balanced.
es: Los <i>jinetes de águila</i> y <i>maestros de águila</i> serán clave en este escenario. Puedes reclutar o reincorporar más, pero es mejor mantener el ejército equilibrado.

source: This scenario might be unwinnable if you end up losing all your eagle riders/masters before completing their specific goal. In the unwinnable case, it is advised to load a previous save and try again.
es: Este escenario puede volverse impasable si pierdes todos tus jinetes y maestros de águila antes de cumplir su objetivo específico. En ese caso, se recomienda cargar una partida guardada anterior e intentarlo de nuevo.
