Repository: knyghtmare/Electrifyre
Catalog: translations/wesnoth-Electrifyre/*.po
Languages: es

source: After my training had been completed, I returned to the village and was appointed as the militia captain. The guarding of the village and its shrine has been mostly uneventful save for the occassional wild beast and ogres. I really longed to have an adventure of my own, an adventure of going to exotic places, battling extraordinary, having a tale worth telling by bards through out the Kingdom.
es: Una vez terminado mi entrenamiento, regresé al pueblo y me nombraron capitán de la milicia. Proteger el pueblo y su santuario había sido casi siempre tranquilo, salvo por alguna bestia salvaje o algún ogro de vez en cuando. Yo realmente anhelaba tener mi propia aventura: viajar a lugares exóticos, combatir lo extraordinario y vivir una historia que valiera la pena ser cantada por los bardos en todo el Reino.

source: Maybe this current retrieval quest for the Electrifyre can be such as this? These mages had stolen our village's most sacred treasure. This did not bode well with the village. We mounted a raiding party immediately for the sole intent of bringing it back.
es: ¿Y si esta misión para recuperar la Electryfire era exactamente eso? Esos magos habían robado el tesoro más sagrado de nuestro pueblo. El pueblo no podía aceptarlo. Formamos de inmediato un grupo de asalto con el único objetivo de traerla de vuelta.

source: The mage, on interrogation, had revealed it was being taken to a fortress to the South, and this was the only clue. We have strided southwards for an entire day, having arrived at a hilly region at the Wild Lands...
es: Bajo interrogatorio, el mago reveló que la llevaban a una fortaleza más al sur. Esa era la única pista. Marchamos hacia el sur durante un día entero y llegamos a una región de colinas en las Tierras Salvajes…

source: After assisting the Scholar Ayanami and acquiring the support of her adepts, we persisted our march further southwards. By now, we had ventured further than we had ever gone before and had entered into unknown territory.
es: Tras ayudar a la erudita Ayanami y conseguir el apoyo de sus adeptas, seguimos marchando más al sur. Para entonces ya habíamos avanzado más lejos que nunca y habíamos entrado en territorio desconocido.

source: Before the first skirmish, we had sent a scout to the Perch to enlist the aid of the Eagle Riders. I really hope they would arrive soon to aid our quest.
es: Antes del primer enfrentamiento, enviamos un explorador al Percha para pedir la ayuda de los jinetes de águila. Espero de verdad que lleguen pronto a apoyarnos.

source: The vampires are an ancient race, having existed since the First Age. How they came to exist is lost knowledge. Once, they had fought alongside our people during the First Elemental War but as the centuries passed, their Monarchy decided to not hold the alliance anymore and we have not been at the best of terms since then.
es: Los vampiros son una raza antigua que existe desde la Primera Era. Cómo llegaron a existir es un conocimiento perdido. En el pasado lucharon junto a nuestro pueblo durante la Primera Guerra Elemental, pero con el paso de los siglos su monarquía decidió romper la alianza y desde entonces no tenemos las mejores relaciones.

source: The vampires had proved themselves to be challenging adversaries during the night, only allowing us to gain ground during the day time. Such an experience reminded me of the legend of an aragwaithi captain who had become a vampire by drinking vampiric blood out of the desire to keep on existing. He was once the commanding officer of Ryuuma Shimotsuki. This commander used his vampiric powers to terrorise the vanguard of the Dunefolk of the war, and initially drove them back.
es: Los vampiros resultaron ser enemigos muy difíciles durante la noche; solo podíamos avanzar de día. Esa experiencia me recordó la leyenda de un capitán Aragwaith que se convirtió en vampiro al beber sangre vampírica por el deseo de seguir viviendo. Ese capitán había sido el superior de Ryuuma Shimotsuki. Con sus poderes vampíricos aterrorizó la vanguardia de los barjanes y al principio los hizo retroceder.

source: However, his transformation was exposed at the heat of battle and his own unit turned on him. The bards did not mention if he was executed or exiled but after his forced resignation, Ryuuma was appointed as the captain of the unit. It was an interesting twist to his heroic exploits during the war.
es: Sin embargo, su transformación fue descubierta en pleno combate y su propia unidad se volvió en su contra. Los bardos no cuentan si lo ejecutaron o lo exiliaron, pero tras su destitución forzada, Ryuuma fue nombrado capitán de la unidad. Fue un giro interesante en sus hazañas heroicas durante la guerra.

source: We ventured further southwards into more uncharted territory. Our few adepts sensed traces of the sword's power further south. After two whole days, we stumbled upon a valley, enshrouded in a thick eerie mist...
es: Seguimos avanzando más al sur, en territorio completamente desconocido. Nuestras pocas adeptas percibían rastros del poder de la espada más al sur. Tras dos días enteros, dimos con un valle envuelto en una espesa niebla inquietante…

source: Facing so many vampires... This might have been the most intense battle of my life. The retrieval excursion of the Wild Lands during my training years was intense, but it was nowhere near as gruesome as this battle.
es: Enfrentar a tantos vampiros… Tal vez fue la batalla más intensa de mi vida. La expedición de recuperación en las Tierras Salvajes durante mis años de entrenamiento fue dura, pero no se compara con lo brutal que fue esta.

source: As our forces clashed against the vampires, we could almost feel their murderous intent. Slashing one down, two more would take its place. They craved our blood. It was a miracle how we survived the night and managed to force their retreat.
es: Cuando nuestras fuerzas chocaron contra los vampiros, casi podíamos sentir su intención asesina. Derribabas a uno y dos más ocupaban su lugar. Deseaban nuestra sangre. Fue un milagro que sobreviviéramos la noche y lográramos obligarlos a retroceder.

source: We finally caught the glimpse of a fortress in the mountains. Our sacred sword was being held there and we had to retrieve it. We did not know what we would be facing there. We were driven by just one thing, our oath to the village which was to retrieve the sword. We found an abandoned fort nearby and decided to use it to rally for the battle...
es: Al fin divisamos una fortaleza en las montañas. Allí tenían nuestra espada sagrada y teníamos que recuperarla. No sabíamos a qué nos enfrentaríamos, pero solo nos impulsaba una cosa: nuestro juramento al pueblo de traer la espada de vuelta. Encontramos un fuerte abandonado cerca y decidimos usarlo para reagruparnos antes de la batalla…

source: To think we would get the opportunity to fight alongside Lord Ryuuma of House Shimotsuki himself. What an honour! My old buddies at the Aeranas training barracks would never believe me if I told them this.
es: Pensar que tendríamos la oportunidad de luchar junto al mismísimo señor Ryuuma de la Casa Shimotsuki… ¡Qué honor! Mis viejos compañeros del cuartel de entrenamiento en Aeranas nunca me creerían si se los contara.

source: The appearance of dwarves and the valefolk inside the fortress and being allied with the mages was disturbing. The Valefolk have not been seen in almost a century and yet, there were here now.
es: La aparición de enanos y habitantes del valle dentro de la fortaleza, aliados con los magos, era inquietante. A los habitantes del valle no se los había visto en casi un siglo y, sin embargo, ahí estaban.

source: Lord Ryuuma was disturbed as well. He ordered the fortress to be searched thoroughly for any clues or informations of this development. We discovered a hidden trap door at the rear of the fortress. It was not before Lord Ryuuma summoned us to the chamber underneath the fortress...
es: El señor Ryuuma también estaba preocupado. Ordenó registrar la fortaleza a fondo en busca de pistas sobre este acontecimiento. Descubrimos una trampilla oculta en la parte trasera. Poco después, el señor Ryuuma nos convocó a la cámara bajo la fortaleza…

source: We had retrieved the Electrifyre! Our village's heirloom is back in our position. Although the great hero, Shimotsuki Ryuuma, had offered us to join him in his quest to investigate the Valefolk involvement, we decided it was best to just return back to the village.
es: ¡Recuperamos la Electryfire! La reliquia de nuestro pueblo volvió a estar en nuestras manos. Aunque el gran héroe Shimotsuki Ryuuma nos ofreció acompañarlo en su misión para investigar la participación de los habitantes del valle, decidimos que lo mejor era regresar al pueblo.

source: The return journey to the village was relatively uneventful. We did face more vampires again, but by employing a proper stratagem we quickly overcame them. Once we had returned to the village, the Electrifyre was placed in his shrine. As a lesson learnt, we have placed even more guards for the shrine to prevent further occurences of robbery.
es: El viaje de regreso al pueblo fue relativamente tranquilo. Sí nos topamos otra vez con vampiros, pero con una buena estrategia los vencimos rápido. Al llegar al pueblo, la Electryfire volvió a su santuario. Aprendimos la lección y ahora hay más guardias para evitar que vuelva a ocurrir un robo.

source: The village was overjoyed with the restoration of the Electrifyre and its shrine. A grand feast was held for this occassion. The coming days in the village were uneventful. As the militia, we returned to just patroling and maintaining vigilance. A part of me wondered what would have happened if we did decide to accompany Lord Ryuuma into the Depths. Would destiny have turned out differently?
es: El pueblo se llenó de alegría con la restauración de la Electryfire y su santuario. Se celebró un gran banquete por la ocasión. Los días siguientes en el pueblo fueron tranquilos. Como milicia, volvimos a patrullar y mantener la vigilancia. Una parte de mí se preguntaba qué habría pasado si hubiéramos decidido acompañar al señor Ryuuma a las Profundidades. ¿El destino habría sido distinto?

source: Maybe I could have gotten more opportunites to participate in an epic war if it ever came and make a name for myself. I guess I shall never know.
es: Tal vez habría tenido más oportunidades de participar en una guerra épica y hacerme un nombre. Supongo que nunca lo sabré.

source: With Lord Ryuuma leading the way, our band of moderately battle-hardened village militia descended into the depths. The dark tunnel extended on and on. It felt nearly endless until we saw a light source in the distance...
es: Con el señor Ryuuma al frente, nuestro grupo de milicianos del pueblo —ya algo curtidos en batalla— descendió a las profundidades. El túnel oscuro se extendía sin fin. Parecía interminable hasta que vimos una fuente de luz a lo lejos…

source: Encountering a remnant delusional Jinn within the depths of the land was not somthing we were expecting. It was a brutal ordeal but we had prevailed in the end. After the Jinn was vanquished or temporarily put to rest (we were not sure what the outcome really meant), we continue our trek and entered another vast cavern. It was a sight to behold...
es: Encontrar a un jinn delirante y residual en las profundidades no era algo que esperáramos. Fue una prueba brutal, pero al final vencimos. Después de derrotar al jinn (o de dormirlo temporalmente, no estábamos seguros), seguimos avanzando y entramos en otra enorme caverna. Era un espectáculo impresionante…

source: Navigating through the 'mushroom forest,' if you can call it that, was a relentless endeavour. We fought a multitude of creatures ranging from venomous scorpions to endless spawning Mudcrawlers.
es: Atravesar el «bosque de hongos» (si se le puede llamar así) fue un esfuerzo sin descanso. Luchamos contra multitud de criaturas, desde escorpiones venenosos hasta reptadores de barro que aparecían sin parar.

source: Like in the Jinn cavern, we had encountered the valefolk here again. The valefolk were clearly coming in considerable numbers to reclaim their fortress. One fact that Lord Ryuuma found concerning is that their dwarven allies were not seen with them in either of the two encounters. Where could they have gone?
es: Al igual que en la caverna del jinn, volvimos a encontrarnos con habitantes del valle. Venían en gran número para recuperar su fortaleza. Algo que preocupaba al señor Ryuuma era que sus aliados enanos no aparecieran en ninguno de los dos encuentros. ¿Dónde podrían estar?

source: We continued on our march. Soon we reached a nexus of cave tunnels going in various directions...
es: Seguimos marchando. Pronto llegamos a un cruce de túneles que se dirigían en varias direcciones…

source: Despite heavy losses, we had managed to collapse and seal off the entrance to the Valefolk city. Although it would have been better to disrupt what ritual the Valefolk were attempting to execute, we did not have the strength necessary to overcome their well erected defenses. With the entrance collapsed, the Valefolk would not be able to mount an offensive on us for the considerable future.
es: A pesar de las grandes pérdidas, logramos derrumbar y sellar la entrada a la ciudad de los habitantes del valle. Habría sido mejor interrumpir el ritual que intentaban realizar, pero no teníamos la fuerza necesaria para superar sus sólidas defensas. Con la entrada colapsada, no podrán atacarnos en un futuro cercano.

source: We bade farewell to our Deep Elven allies and returned to the surface. Now, we had retrieved the Electrifyre! Moreover, we had the honour of fighting alongside one of the Kingdom's greatest swordsmen, Shimotsuki Ryuuma. His feats during the southern war had been the talk of the town for many a month. To think, we commonfolk had the opportunity to participate in an epic quest with him.
es: Nos despedimos de nuestros aliados elfos profundos y regresamos a la superficie. ¡Habíamos recuperado la Electryfire! Además, tuvimos el honor de luchar junto a uno de los mejores espadachines del Reino, Shimotsuki Ryuuma. Sus hazañas en la guerra del sur habían sido la comidilla durante meses. Pensar que nosotros, gente común, tuvimos la oportunidad de participar en una búsqueda épica con él.

source: Afterwards, we returned to our village. Surprisingly, Lord Shimotsuki and his regiment offered to accompany us. This was reassuring as their mere presence would stave off the vampires.
es: Después regresamos al pueblo. Sorprendentemente, el señor Shimotsuki y su regimiento se ofrecieron a acompañarnos. Eso era tranquilizador, porque su mera presencia mantendría alejados a los vampiros.

source: The village was overjoyed with the restoration of the Electrifyre and its shrine. A grand feast was held for this occassion. Lord Shimotsuki and his soldiers even stayed for a fornight and trained some of us for more proficient combat. He felt that the Aragwaithi should stay ever vigilant to be a beacon of leadership and hope in the wake of some new cataclysm.
es: El pueblo se llenó de alegría con la restauración de la Electryfire y su santuario. Se celebró un gran banquete. El señor Shimotsuki y sus soldados se quedaron una quincena y entrenaron a algunos de nosotros para combatir mejor. Él consideraba que los Aragwaithi debían mantenerse siempre alerta para ser un faro de liderazgo y esperanza ante cualquier nuevo cataclismo.

source: Several months later, a scout from Aeranas arrived with a summons for me to the Northern city. I made no delays and ventured forth immediately. A week later, I found myself entering the Royal Gardens at Aeranas...
es: Varios meses después, un explorador de Aeranas llegó con una convocatoria para mí a la ciudad del norte. No perdí tiempo y partí de inmediato. Una semana después me encontré entrando en los Jardines Reales de Aeranas…

source: A Village Robbed
es: Un pueblo saqueado

source: Ogres
es: Ogros

source: Defeat Cendrillon the Mage
es: Derrotar a Cendrillon el mago

source: Keep Cendrillon and his elementals at bay
es: Mantener a Cendrillon y sus elementales a raya

source: Hint:
es: Pista:

source: Engage the enemy units in groups of 2 or 3 units.
es: Enfrenta a las unidades enemigas en grupos de 2 o 3.

source: Expose enemy units to their worst terrain.
es: Lleva a las unidades enemigas a su terreno más desfavorable.

source: Keep your Aragwaith Adepts alive.
es: Mantén vivas a tus Adeptas Aragwaithi.

source: Try to restrict enemy units using ZoC.
es: Intenta limitar el movimiento enemigo usando zonas de control.

source: Right-Click on Hikaru to see How to Play Guide.
es: Haz clic derecho sobre Hikaru para ver la guía de cómo jugar.

source: Ah, just another usual day of being the village militia. I wish something extraordinary happened once.
es: Ah, solo otro día normal siendo la milicia del pueblo. Ojalá ocurriera algo extraordinario alguna vez.

source: I grew up reading so much about the great heroes of our people that I really want my own sort of adventure. An adventure of the like Ryuuma had before he became the war hero of the Great War.
es: Crecí leyendo tanto sobre los grandes héroes de nuestro pueblo que realmente quiero tener mi propia aventura, del tipo que tuvo Ryuuma antes de convertirse en el héroe de la Gran Guerra.

source: Be careful what you wish for.
es: Ten cuidado con lo que deseas.

source: Hikaru, you forget that Ryuuma of Shimotsuki made his mark during the great war at the southern borders. After the war ended, there have not been any major happenings.
es: Hikaru, olvidas que Ryuuma de Shimotsuki dejó su huella durante la gran guerra en las fronteras del sur. Desde que terminó la guerra no ha pasado nada importante.

source: Hey, look! There is movement near the ruins!
es: ¡Oye, mira! ¡Hay movimiento cerca de las ruinas!

source: That's where we keep the...
es: ¡Ahí es donde guardamos la…!

source: Looks like the Lady was correct! I sense it here!
es: ¡Parece que la señora tenía razón! ¡La siento aquí!

source: There it is!
es: ¡Ahí está!

source: Hey, wait! You there! What are you doing?
es: ¡Oye, espera! ¡Tú ahí! ¿Qué están haciendo?

source: It does not matter. We have what we need. You go on ahead. I shall delay them a bit and join up with you!
es: No importa. Ya tenemos lo que necesitamos. Tú sigue adelante. Yo los retrasaré un poco y luego me reúno contigo.

source: Hikaru, they have taken the Electrifyre!
es: ¡Hikaru, se llevaron la Electryfire!

source: That relic has been under the protection of our village since time immemorial! We must retrieve it at all costs!
es: ¡Esa reliquia ha estado bajo la protección de nuestro pueblo desde tiempos inmemoriales! ¡Tenemos que recuperarla a toda costa!

source: Quick! Rally to me and we shall engage this enemy!
es: ¡Rápido! ¡Reúnanse conmigo y enfrentemos a este enemigo!

source: The <span color='#FFA756'><i>Unstable Elementals</i></span> units will switch forms based on the terrain they are on. Use this knowledge to expose their weakest form. The <span color='#FFA756'><i>Fire Guardian</i></span> units might be slightly stronger than usually encountered. The <span color='#FFA756'><i>Ice Ghosts</i></span> can inflict slow and are fast. The <span color='#FFA756'><i>Giant Mudcrawlers</i></span> and <span color='#FFA756'><i>Mudcrawlers</i></span> can be easily overwhelmed by bladed or piercing attacks, just do not let them attack you in packs. Try to restrict their movement by exploiting the Zone of Control (ZoC). It is advisable to confront them in groups of two of three units and in locations where the enemy units cannot benefit from. Good Luck.
es: Las unidades <span color='#FFA756'><i>elementales inestables</i></span> cambian de forma según el terreno en que estén. Usa ese conocimiento para exponer su forma más débil. Las unidades <span color='#FFA756'><i>guardianes de fuego</i></span> pueden ser un poco más fuertes de lo habitual. Los <span color='#FFA756'><i>fantasmas de hielo</i></span> pueden ralentizar y son rápidos. A los <span color='#FFA756'><i>reptadores de barro gigantes</i></span> y <span color='#FFA756'><i>reptadores de barro</i></span> se los puede vencer fácilmente con ataques cortantes o perforantes, pero no los dejes atacarte en grupo. Intenta limitar su movimiento usando zonas de control (ZoC). Lo recomendable es enfrentarlos en grupos de dos o tres unidades y en lugares donde el enemigo no se beneficie del terreno. ¡Buena suerte!

source: When encountering new enemy units, it is always worthwhile to check the unit on the sidebar UI. You might see some new traits or abilities not seen before and this data can guide you in formulating your strategy more effectively.
es: Cuando te enfrentes a unidades enemigas nuevas, siempre vale la pena revisarlas en la barra lateral. Puede que veas rasgos o habilidades que no habías visto antes y esa información te ayudará a planear mejor tu estrategia.

source: Where were the guards that have been stationed there for the night?
es: ¿Dónde estaban los guardias que dejamos de turno esta noche?

source: Oh, those two? They got in the way. We took care of them.
es: Ah, ¿esos dos? Estorbaron. Nos encargamos de ellos.

source: I shall make you regret doing that!
es: ¡Te haré arrepentirte de haber hecho eso!

source: Send a scout to the Perch! We shall require the aid of the Eagle Riders in catching the robbers!
es: ¡Envíen un explorador al Percha! ¡Necesitaremos la ayuda de los jinetes de águila para atrapar a los ladrones!

source: There are some wild ogres near by!
es: ¡Hay ogros salvajes cerca!

source: Do not enrage them. I think it's better if we let the enemy agitate them first.
es: No los enfurezcamos. Creo que es mejor dejar que el enemigo los provoque primero.

source: They seem to be approaching the enemy from their den. This might work in our favor.
es: Parece que se acercan al enemigo desde su guarida. Esto podría jugar a nuestro favor.

source: <i>Aragwaith Adepts</i> have a strong magical ranged attack and can heal your units. The number of adepts available to you right now is limited and hence, you should try your best to keep them alive in this scenario.
es: Las <i>Adeptas Aragwaithi</i> tienen un potente ataque mágico a distancia y pueden sanar a tus unidades. Ahora mismo el número de adeptas es limitado, así que haz todo lo posible por mantenerlas vivas en este escenario.

source: Hikaru is a <i>Longswordsman</i> and as such, he has superior offense capabilities and moderate defences. It is best to utilize him to damage enemy units enough for other lower level units to land the killing blow and get the experience.
es: Hikaru es un <i>Espadachín Largo</i> y por eso tiene gran capacidad ofensiva y defensas moderadas. Lo mejor es usarlo para dañar lo suficiente a las unidades enemigas y que unidades de nivel más bajo den el golpe final y ganen experiencia.

source: Archers are cheap to recruit, so you can have a lot of them. They are good at shooting from far away, and you can make them even better by upgrading them later.
es: Los Arqueros son baratos de reclutar, así que puedes tener muchos. Son buenos disparando desde lejos y los puedes hacer aún mejores al subirlos de nivel.

source: The Spearman is strong in attack and decent in defense, so keep about 1-2 Spearmen to protect important areas. Spearmen can become leaders, making them even more valuable later.
es: El Lancero es fuerte en ataque y decente en defensa, así que mantén 1 o 2 protegiendo zonas importantes. Los lanceros pueden convertirse en líderes, lo que los hace aún más valiosos después.
