Repository: knyghtmare/Electrifyre
Catalog: translations/wesnoth-Electrifyre/*.po
Languages: es

source: Dependency:
es: Dependencia:

source: War of Legends
es: Guerra de Leyendas

source: Not Installed
es: No instalada

source: Installed
es: Instalada

source: vibrant green
es: verde vibrante

source: An ancient relic from the First Elemental War being guarded by an aragwaith village has been stolen. It is up to the local militia to bring it back.
es: Una antigua reliquia de la Primera Guerra Elemental que era custodiada por un pueblo aragwaith ha sido robada. Ahora depende de la milicia local recuperarla.

source: (Rookie Level, 9 scenarios)
es: (Nivel principiante, 9 escenarios)

source: This campaign features the Aragwaithi.
es: Esta campaña presenta a los aragwaithi.

source: The tutorial difficulty of this campaign is aimed at first time players.
es: La dificultad tutorial de esta campaña está pensada para jugadores que la prueban por primera vez.

source: This campaign accepts donations on Ko-fi: https://ko-fi.com/tahsinjahinkhalid
es: Esta campaña acepta donaciones en Ko-fi: https://ko-fi.com/tahsinjahinkhalid

source: Feedback: https://discord.gg/rsePgjHRPA (Wesnoth Modders Guild)
es: Comentarios y sugerencias: https://discord.gg/rsePgjHRPA (Gremio de modders de Wesnoth)

source: Requires <i>War of Legends</i> to be installed
es: Requiere tener instalada <i>Guerra de Leyendas</i>

source: An Aragwaith Story
es: Una historia aragwaith

source: Swordsman
es: Espadachín

source: Guardsman
es: Guardia

source: Challenging
es: Desafiante

source: Sentinel
es: Centinela

source: Difficult
es: Difícil

source: Author and Scenario Designer
es: Autor y diseñador de escenarios

source: Playtesting and Feedback
es: Pruebas de juego y comentarios

source: An Unforgettable Journey
es: Un viaje inolvidable

source: Completed the campaign <i>Electrifyre</i>.
es: Campaña <i>Electrifyre</i> completada.

source: Completed the scenario <i>A Village Robbed</i>.
es: Escenario <i>Un pueblo saqueado</i> completado.

source: Completed the scenario <i>Wild Knolls</i>.
es: Escenario <i>Colinas salvajes</i> completado.

source: Completed the scenario <i>Southern Sojourn</i>.
es: Escenario <i>Estancia sureña</i> completado.

source: Completed the scenario <i>Fogbound Valley</i>.
es: Escenario <i>Valle envuelto en niebla</i> completado.

source: Completed the scenario <i>The Mage and the Sword</i>.
es: Escenario <i>El mago y la espada</i> completado.

source: Completed the scenario <i>Forsaken Hall</i>.
es: Escenario <i>Salón abandonado</i> completado.

source: Completed the scenario <i>Dark Tunnel</i>.
es: Escenario <i>Túnel oscuro</i> completado.

source: Completed the scenario <i>Realm of Stings</i>.
es: Escenario <i>Reino de los aguijones</i> completado.

source: Completed the scenario <i>Lake in the Depths</i>.
es: Escenario <i>Lago en las profundidades</i> completado.

source: Completed the scenario <i>Enemy of My Enemy</i>.
es: Escenario <i>El enemigo de mi enemigo</i> completado.

source: Completed the scenario <i>UNTITLED</i>.
es: Escenario <i>SIN TÍTULO</i> completado.

source: Completed the scenario <i>Bastion of the Forgotten</i>.
es: Escenario <i>Bastión de los olvidados</i> completado.

source: A Journey Etched in the Memories
es: Un viaje grabado en la memoria

source: Completed the campaign <i>Electrifyre</i> on the Hardest Difficulty.
es: Campaña <i>Electrifyre</i> completada en la dificultad más alta.

source: Completed the scenario <i>A Village Robbed</i> on the Hardest Difficulty.
es: Escenario <i>Un pueblo saqueado</i> completado en la dificultad más alta.

source: Completed the scenario <i>Wild Knolls</i> on the Hardest Difficulty.
es: Escenario <i>Colinas salvajes</i> completado en la dificultad más alta.

source: Completed the scenario <i>Southern Sojourn</i> on the Hardest Difficulty.
es: Escenario <i>Estancia sureña</i> completado en la dificultad más alta.

source: Completed the scenario <i>Fogbound Valley</i> on the Hardest Difficulty.
es: Escenario <i>Valle envuelto en niebla</i> completado en la dificultad más alta.

source: Completed the scenario <i>The Mage and the Sword</i> on the Hardest Difficulty.
es: Escenario <i>El mago y la espada</i> completado en la dificultad más alta.

source: Completed the scenario <i>Forsaken Hall</i> on the Hardest Difficulty.
es: Escenario <i>Salón abandonado</i> completado en la dificultad más alta.

source: Completed the scenario <i>Dark Tunnel</i> on the Hardest Difficulty.
es: Escenario <i>Túnel oscuro</i> completado en la dificultad más alta.

source: Completed the scenario <i>Realm of Stings</i> on the Hardest Difficulty.
es: Escenario <i>Reino de los aguijones</i> completado en la dificultad más alta.

source: Completed the scenario <i>Lake in the Depths</i> on the Hardest Difficulty.
es: Escenario <i>Lago en las profundidades</i> completado en la dificultad más alta.

source: Completed the scenario <i>Enemy of My Enemy</i> on the Hardest Difficulty.
es: Escenario <i>El enemigo de mi enemigo</i> completado en la dificultad más alta.

source: Completed the scenario <i>UNTITLED</i> on the Hardest Difficulty.
es: Escenario <i>SIN TÍTULO</i> completado en la dificultad más alta.

source: Completed the scenario <i>Bastion of the Forgotten</i> on the Hardest Difficulty.
es: Escenario <i>Bastión de los olvidados</i> completado en la dificultad más alta.

source: Questing in the Knolls
es: Misiones en las colinas

source: You have completed the hidden quests in <i>Wild Knolls</i>!
es: ¡Has completado las misiones ocultas en <i>Colinas salvajes</i>!

source: Eliminated the Giant Ant Queen
es: Reina hormiga gigante eliminada

source: Eliminated the Fire Ant Queen
es: Reina hormiga de fuego eliminada

source: Found the faerie hermit
es: Hada Ermitaña encontrada

source: Rescued the trapped Aragwaith ranger.
es: Guardabosques aragwaith atrapado rescatado.

source: Friend of the Fae (Hidden Quest)
es: Amigo de las hadas (misión oculta)

source: You have completed the hidden quest <i>Friend of the Fae</i> in this campaign.
es: Has completado la misión oculta <i>Amigo de las hadas</i> en esta campaña.

source: You found the faerie hibernating inside the tree!
es: ¡Encontraste al hada hibernando dentro del árbol!

source: You found the faerie's sister!
es: ¡Encontraste a la hermana del hada!

source: You found the sacred faerie grove!
es: ¡Encontraste el bosquecillo sagrado de las hadas!

source: Overcame the Elements
es: Venció a los elementos

source: Defeated the mage in <i>A Village Robbed</i>.
es: Mago derrotado en <i>Un pueblo saqueado</i>.

source: Roar of the Woses
es: Rugido de los woses

source: Obtained assistance from the woses in <i>Southern Sojourn</i>.
es: Ayuda de los woses obtenida en <i>Estancia sureña</i>.

source: Let there be Light!
es: ¡Que haya luz!

source: Found all the Luminous Stones in <i>Fogbound Valley</i>.
es: Todas las piedras luminosas encontradas en <i>Valle envuelto en niebla</i>.

source: Torture of Torches
es: Tortura de las antorchas

source: Solved the Torch Puzzle in <i>Ephemeral Calm</i>.
es: Rompecabezas de antorchas resuelto en <i>Calma efímera</i>.

source: Spirit Vanquisher
es: Vencedor de espíritus

source: Defeat the Jinn in <i>Forsaken Hall</i>
es: Jinn derrotado en <i>Salón abandonado</i>

source: Queen of the Stings
es: Reina de los aguijones

source: Defeat the Queen Scorpion in <i>Realm of Stings</i>
es: Reina escorpión derrotada en <i>Reino de los aguijones</i>

source: Spored and Confused
es: Esporas y confusión

source: Attacked all three species of giant shrooms in <i>Realm of Stings</i>, knowing the consequences...
es: Atacaste a las tres especies de hongos gigantes en <i>Reino de los aguijones</i>, sabiendo las consecuencias...

source: Attacked a Shroom
es: Hongo atacado

source: Attacked an Elder Shroom
es: Hongo anciano atacado

source: Attacked an Ancient Shroom
es: Hongo ancestral atacado

source: Stalking of the Stings
es: Acecho de los aguijones

source: Killed at least one of every species of scorpion in the <i>Realm of Stings</i>.
es: Mataste al menos un ejemplar de cada especie de escorpión en el <i>Reino de los aguijones</i>.

source: Killed a Giant Scorpling
es: Escorpión gigante joven eliminado

source: Killed a Sand Scamperer
es: Corredor de arena eliminado

source: Killed a Giant Scorpion
es: Escorpión gigante eliminado

source: Killed a Sand Scuttler
es: Escurridizo de arena eliminado

source: Killed a Rock Scorpion
es: Escorpión de roca eliminado

source: A Disappointment
es: Una decepción

source: Found a way to end the campaign in a cowardly way.
es: Encontraste una forma cobarde de terminar la campaña.

source: infiltration
es: infiltración

source: This unit negates enemy Zones of Control around itself for self and allied units.
es: Esta unidad anula las zonas de control enemigas alrededor de sí misma tanto para sí como para unidades aliadas.

source: This attack always strikes second, even if used offensive.
es: Este ataque siempre golpea en segundo lugar, incluso cuando se usa ofensivamente.

source: All is lost now that I am dead...
es: Todo está perdido ahora que estoy muerto...

source: Ouch! I was not supposed to die!
es: ¡Auch! ¡No se suponía que iba a morir!

source: How can I be defeated like this?
es: ¿Cómo puedo ser derrotado de esta forma?

source: The archers serve as the primary long-range combat unit for the faction. Their recruitment is cost-effective, making them a strategic choice for comprising a significant portion of your army, ideally around fifty percent. They not only deliver effective ranged attacks but also benefit from valuable level two and three enhancements. Prioritizing their upgrades can significantly bolster their combat efficiency.
es: Los arqueros son la unidad principal de combate a distancia de la facción. Su reclutamiento es barato, lo que los convierte en una elección estratégica para formar una buena parte del ejército, idealmente cerca del cincuenta por ciento. No solo hacen ataques a distancia efectivos, sino que también tienen mejoras valiosas en nivel 2 y 3. Darles prioridad al subir de nivel aumenta mucho su efectividad en combate.

source: The auxiliary tank unit, known for its proficient piercing attack, excels in defensive roles. However, its capability to withstand hits is limited. It is advisable to deploy 1-2 Spearmen to guard crucial positions. Additionally, as Spearman advance, they can acquire the leadership ability, enhancing their strategic value significantly.
es: Unidad tanque auxiliar conocida por su buen ataque perforante y que destaca en posiciones defensivas. Sin embargo, su resistencia es limitada. Se recomienda tener 1-2 lanceros protegiendo puntos clave. Además, al avanzar, los lanceros pueden obtener la habilidad de liderazgo, lo que aumenta mucho su valor estratégico.

source: The auxiliary melee unit, notably without a ranged attack, is susceptible to enemy archers. Employ them sparingly, increasing their numbers only when confronting numerous enemies weak against slashing damage. Swordsman upgrades are specialized, focusing either on survivability or damage, rather than offering comprehensive enhancements.
es: Unidad cuerpo a cuerpo auxiliar que no tiene ataque a distancia y es muy vulnerable a arqueros enemigos. Úsala con moderación y aumenta su número solo cuando enfrentes muchos enemigos débiles al daño cortante. Las mejoras del espadachín son especializadas: algunas aumentan la supervivencia y otras el daño, no son mejoras completas.

source: Healers, capable of inflicting considerable fire damage, are nonetheless costly and prone to enemy attacks. It is prudent to recruit 1-2 healers and ensure their protection. Prioritizing their advancement is key, as at higher levels, they transform into potent attackers, versatile and valuable in various scenarios.
es: Los sanadores pueden infligir buen daño de fuego, pero son caros y muy vulnerables. Es prudente reclutar solo 1-2 y protegerlos bien. Darles prioridad al subir de nivel es clave, porque en niveles altos se convierten en atacantes poderosos, versátiles y muy valiosos.

source: The Scout, a swifter variant of the Spearman, serves auxiliary roles due to its lesser strength compared to the Eagle rider. It is advisable to enlist Scouts when immediate piercing damage on the battlefield is necessary.
es: El explorador es una versión más rápida del lancero y cumple roles auxiliares, ya que es menos fuerte que el jinete de águila. Reclútalos cuando necesites daño perforante rápido en el campo de batalla.

source: This faction's principal scout unit is proficient in dealing a respectable amount of damage. Its dual capability for slashing and smashing attacks equips it to effectively counter a variety of opponents.
es: La unidad de exploración principal de esta facción hace un daño respetable. Gracias a sus ataques cortantes y de impacto puede enfrentarse eficazmente a muchos tipos de enemigos.

source: Role:
es: Rol:

source: How to Play: Aragwaithi
es: Cómo jugar: Aragwaithi

source: Which section would you like to read?
es: ¿Qué sección quieres leer?

source: Archer
es: Arquero

source: ranged pierce damage
es: daño perforante a distancia

source: Spearman
es: Lancero

source: melee pierce damage and weak tank
es: daño perforante cuerpo a cuerpo y tanque débil

source: melee blade damage
es: daño cortante cuerpo a cuerpo

source: Adept
es: Adepto

source: ranged fire damage and healer
es: daño de fuego a distancia y sanador

source: Scout
es: Explorador

source: scouting and melee pierce damage
es: exploración y daño perforante cuerpo a cuerpo

source: Eagle Rider
es: Jinete de águila

source: scouting and melee impact and blade damage
es: exploración y daño de impacto y cortante cuerpo a cuerpo

source: Faction Guide
es: Guía de la facción

source: Ah! This looks cold but is actually comfortably warm!
es: ¡Ah! Parece frío pero en realidad está cálido y cómodo.

source: Orb of Frost Resistance
es: Orbe de resistencia al frío

source: A shimmering sphere of ice-blue light, the Orb of Frost Resistance pulses with an unique energy, granting its bearer defiance against the biting chill of winter's wrath.
es: Una esfera brillante de luz azul hielo. El Orbe de resistencia al frío pulsa con una energía única que otorga a su portador protección contra el frío mordiente del invierno.

source: <span fgcolor='grey' ><b>+30% Cold Resistance</b></span>
es: <span fgcolor='grey' ><b>+30 % de resistencia al frío</b></span>

source: Equip the Orb
es: Equipar el orbe

source: Refuse to Equip
es: Rechazar equiparlo

source: Electrifyre: the Sword of Storms
es: Electrifyre: la espada de las tormentas

source: This pristine longsword has been in possession of the Aragwaithi for generations. Legend speculates that the sword might have been crafted the essence of a once mighty Lightning Dragon Lord during the First Elemental War. Regardless, the sword is of exceptionally high quality and is well suited for a master swordsman.
es: Esta espada larga impecable ha estado en posesión de los Aragwaithi durante generaciones. La leyenda dice que pudo haberse forjado con la esencia de un poderoso Señor Dragón del Relámpago durante la Primera Guerra Elemental. En cualquier caso, es una espada de calidad excepcional y perfecta para un maestro espadachín.

source: <span fgcolor='grey'><b>Melee type becomes <i>electric</i>, melee accuracy is increased by 20% and melee damage is increased by 2.</b></span>
es: <span fgcolor='grey'><b>El ataque cuerpo a cuerpo pasa a ser de tipo <i>eléctrico</i>, precisión cuerpo a cuerpo +20 % y daño cuerpo a cuerpo +2.</b></span>

source: Take It
es: Tomarla

source: Refuse It
es: Rechazarla

source: electric-enchanted
es: encantado con electricidad

source: This weapon will deal electric damage, If faced against any foe with superior electric resistance, it will deal blade damage instead.
es: Este arma inflige daño eléctrico. Si el enemigo tiene mucha resistencia eléctrica, infligirá daño cortante en su lugar.

source: Underground (Illuminated)
es: Subterráneo (iluminado)

source: Hint
es: Pista

source: Death of Hikaru
es: Muerte de Hikaru

source: Death of Soryu
es: Muerte de Soryu

source: Switch On Attack Miss Hightlight Event
es: Activar resaltado de ataques fallidos

source: Attack Miss Hightlighter has been enabled!
es: ¡Resaltado de ataques fallidos activado!

source: Switch Off Attack Miss Hightlight Event
es: Desactivar resaltado de ataques fallidos

source: Attack Miss Hightlighter has been disabled!
es: ¡Resaltado de ataques fallidos desactivado!

source: <span size='x-small'>Miss</span>
es: <span size='x-small'>Fallo</span>

source: team_name^Aragwaithi
es: Aragwaithi

source: team_name^Elementals
es: Elementales

source: team_name^Deep Elves
es: Elfos profundos

source: Vampires
es: Vampiros

source: Monsters
es: Monstruos

source: Wyrms
es: Vérmilos

source: ogres
es: ogros

source: Valefolk
es: Habitantes del valle

source: Dwarves
es: Enanos

source: Excerpt from a journal at the Great Library:
es: Extracto de un diario de la Gran Biblioteca:

source: Hello, respected reader, I do not know how you got your hands on this journal, but I am glad you did. This is a life-changing story for me and I wish to share it with you. Before we can being, I have to give you a lesson in history. These account of events have been passed down in our village from generation to generation. This chronicle of events is called the First Elemental War and we have been told that we must never forget it.
es: Hola, respetado lector. No sé cómo llegó este diario a sus manos, pero me alegra que así sea. Esta es una historia que cambió mi vida y quiero compartirla contigo. Antes de empezar, tengo que darte una pequeña lección de historia. Estos eventos se han transmitido de generación en generación en nuestro pueblo. La crónica se conoce como la Primera Guerra Elemental y siempre nos han dicho que nunca debemos olvidarla.

source: The First Elemental War took place several centuries ago, a cataclysmic war that had erupted throughout the known continents of Irdya. The forces of the Dark Elementalist, a sorcerer with unrivaled mastery of all magic, wished to extinguish all life from Irdya and had unleased his endless legions of undead and elementals on the world. His will and power had been opposed by the combined alliance of the world's races including ours, the Aragwaithi.
es: La Primera Guerra Elemental ocurrió hace varios siglos. Fue una guerra cataclísmica que estalló en todos los continentes conocidos de Irdya. Las fuerzas del Elementalista Oscuro, un hechicero con dominio absoluto de toda la magia, querían extinguir toda vida en Irdya y desató sus interminables legiones de no muertos y elementales sobre el mundo. Su voluntad y poder fueron enfrentados por la alianza combinada de todas las razas del mundo, incluidos los nuestros: los Aragwaithi.

source: The war went on for almost a century until it finally concluded. The immortal evil was sealed away and the world could rebuild from the ashes. The Aragwaithi then founded their Great Kingdom at Northwestern Argea, which some called the Old Continent. Centuries have passed and the Aragwaithi grew to be the most noble, organised, and stable of all the world's races.
es: La guerra duró casi un siglo hasta que finalmente terminó. El mal inmortal fue sellado y el mundo pudo reconstruirse de las cenizas. Los Aragwaithi fundaron entonces su Gran Reino en el noroeste de Argea, al que algunos llaman el Continente Antiguo. Han pasado siglos y los Aragwaithi se han convertido en la raza más noble, organizada y estable de todo el mundo.

source: Now, we can get back into my story. You might be wondering how does all this relates to our village? Well, I shall disclose the information. Our village founder, Miyamura, had been a hero of the First Elemental War and his greatest feat was the demise of the Great Lightning Dragon. The Aragwaith Great Sorceresses of that time had imbued the dragon's essence in his sword allowing it to harness the lightning itself.
es: Ahora sí puedo volver a mi historia. Tal vez te preguntes qué tiene que ver todo esto con nuestro pueblo. Te lo contaré. El fundador de nuestro pueblo, Miyamura, fue un héroe de la Primera Guerra Elemental y su mayor hazaña fue acabar con el Gran Dragón del Relámpago. Las grandes Hechiceras Aragwaithi de aquella época impregnaron la esencia del dragón en su espada, permitiéndole dominar el propio relámpago.

source: Now, this sword, known as the <i>Electrifyre</i> now rests in the shrine just outside our village and it is our sworn duty as the Aragwaithi to watch over, protect and never allow it to fall into the wrong hands.
es: Ahora esa espada, conocida como <i>Electrifyre</i>, descansa en el santuario justo fuera de nuestro pueblo y es nuestro deber jurado como Aragwaithi vigilarla, protegerla y nunca permitir que caiga en las manos equivocadas.

source: The lands of the Aragwaithi have been mostly peaceful and the sword had not been in danger any time save for that one time...
es: Las tierras de los Aragwaithi han sido mayormente pacíficas y la espada nunca había estado en peligro… salvo aquella única vez…

source: I should tell you something about myself as we progress further into the story. I was given the name Hikaru and I descend from the line of Miyamura himself. As such, I had been brought up as a swordsman in the Aragwaithian way of tradition and honor.
es: Debería contarte algo sobre mí mientras avanzamos en la historia. Me pusieron el nombre Hikaru y desciendo directamente de la línea de Miyamura. Por eso me criaron como espadachín siguiendo la tradición y el honor Aragwaithiano.

source: During my training at the city of Aeranas, I sometimes used to listen to the bards at the city square to learn of the tales of the modern heroes of our people. The Aragwaith-Dunefolk war was going on at the time, so the bards had plenty of stories to sing and exaggerate. One such individual stood out from the rest: Ryuuma Shimotsuki.
es: Durante mi entrenamiento en la ciudad de Aeranas, a veces escuchaba a los bardos en la plaza para conocer las hazañas de los héroes modernos de nuestro pueblo. En esa época estaba en curso la guerra entre Aragwaithi y barjanes, así que los bardos tenían muchas historias que cantar (y exagerar). Uno de ellos destacaba por encima del resto: Ryuuma Shimotsuki.

source: He hailed from a town at the southern region, one of the towns that had been caught in the crossfire during the early stages of the war. Having narrowly escaped death, and the sole survivor of his family, Ryuuma had enlisted and trained ceaselessly to become a warrior.
es: Provenía de un pueblo en la región sur, uno de los tantos que quedaron atrapados en el fuego cruzado durante las primeras etapas de la guerra. Tras escapar por poco de la muerte y ser el único sobreviviente de su familia, Ryuuma se alistó y entrenó sin descanso para convertirse en guerrero.

source: During his first mission and every mission henceforth, Ryuuma proved his skills in battle, besting any foe that crossed blades with him or conquering any beast that challenged him. His greatest feat was during the climax of the war where he fought in the frontlines and battled his way through to the current Great Sultan and forced his surrendered. The war had finally ended and he had been declared a hero by the Crown Prince.
es: En su primera misión y en todas las siguientes, Ryuuma demostró su habilidad en combate: vencía a cualquier enemigo que cruzara espadas con él y derrotaba a cualquier bestia que lo desafiara. Su mayor hazaña ocurrió en el clímax de la guerra, cuando luchó en primera línea, se abrió paso hasta el Gran Sultán actual y lo obligó a rendirse. La guerra terminó al fin y el príncipe heredero lo declaró héroe.
