Repository: knyghtmare/Electrifyre
Catalog: translations/wesnoth-Electrifyre/*.po
Languages: es

source: In the next few scenarios and the following, you can control the movements of your allied leader, Ryuuma. If you right-click on Ryuuma, you can see that you can order him to stay on his current hex. If you have done, you can right-click again and disable that command.
es: En los próximos escenarios puedes controlar los movimientos de tu líder aliado, Ryuuma. Si haces clic derecho sobre Ryuuma, verás que puedes ordenarle quedarse en su casilla actual. Para cancelar la orden, haz clic derecho otra vez.

source: On any other reachable hex, you can tell Ryuuma to move there as well via right-clicking. You can also cancel that movement order via right-clicking again. When selecting a hex for Ryuuma to moveto, always pick one within his movement range. Otherwise, he will not move.
es: En cualquier otra casilla alcanzable, puedes ordenarle a Ryuuma que se mueva allí con clic derecho. Puedes cancelar esa orden con otro clic derecho. Al elegir una casilla para Ryuuma, siempre elige una dentro de su rango de movimiento; de lo contrario, no se moverá.

source: Ryuuma will attack anything he gets adjacent too, but remember well that he is a powerful tank unit (a unit with strong defense and damage reduction) so strategically position him to prevent enemy progression.
es: Ryuuma atacará cualquier cosa que se le acerque, pero recuerda que es una unidad tanque poderosa (con gran defensa y reducción de daño), así que posiciona estratégicamente para bloquear el avance enemigo.

source: The other units of Ryuuma side will follow him and attack enemies in the surrounding area of Ryuuma.
es: Las demás unidades del bando de Ryuuma lo seguirán y atacarán a los enemigos cerca de él.

source: Hey, I see this small tower, and it's summoning things!
es: ¡Oye, veo esta torre pequeña y está invocando cosas!

source: Those might be the jinn's conduits! Destroy them!
es: ¡Esos deben ser los conductos del jinn! ¡Destrúyanlos!

source: You heard him! Let's go!
es: ¡Lo oyeron! ¡Vamos!

source: Look! The Valefolk are here!
es: ¡Miren! ¡Los habitantes del valle están aquí!

source: They appear to be trapped here as well!
es: ¡También parecen estar atrapados aquí!

source: The aragwaithi are here?! Does that mean the Mage Lord was defeated?
es: ¿¡Los aragwaithi están aquí!? ¿Eso significa que derrotaron a la señora maga?

source: It seems the mage lord's magic had suppressed the Jinn this whole time and without her, the Jinn is now free to enact his games.
es: Parece que la magia de la señora maga mantenía suprimido al jinn todo este tiempo y sin ella, ahora el jinn es libre de jugar sus juegos.

source: There are saurians here!
es: ¡Hay saurios aquí!

source: Ah, more treasure thieves! Defend the treasure!
es: ¡Ah, más ladrones de tesoros! ¡Defiendan el tesoro!

source: It seems they have piled a considerable portion of gold there. It would be nice if you requistioned it for ourselves.
es: Parece que amontonaron una buena cantidad de oro ahí. Sería bueno requisarlo para nosotros.

source: Undead...they have not been seen since the end of the First Elemental War!
es: No muertos… ¡no se los veía desde el final de la Primera Guerra Elemental!

source: You can attack us all you want but we shall never yield, damned jinn!
es: ¡Pueden atacarnos todo lo que quieran, pero nunca nos rendiremos, maldito jinn!

source: They may be undead but they seem to be opposing the Jinn as well. We might be able to use this to our advantage.
es: Pueden ser no muertos, pero también se oponen al jinn. Tal vez podamos usar eso a nuestro favor.

source: Still standing? It does not matter. I shall now end you myself!
es: ¿Todavía de pie? No importa. ¡Ahora los acabaré yo mismo!

source: I guess I go back to my slumber and wait for the next set of fools to enter my domain...
es: Supongo que vuelvo a dormir y espero al próximo grupo de tontos que entre en mi dominio…

source: This is taking too long!
es: ¡Esto está tardando demasiado!

source: He has inflicted a slowing curse on us!
es: ¡Nos lanzó una maldición de ralentización!

source: Perhaps I was being too lenient...
es: Tal vez fui demasiado indulgente…

source: This is even more terrible than the last one!
es: ¡Esto es aún peor que el anterior!

source: We must make haste and defeat him or he might execute us for good!
es: ¡Debemos apresurarnos y derrotarlo o nos matará de verdad!

source: Realm of Stings
es: Reino de los aguijones

source: Scorpions
es: Escorpiones

source: Crabs
es: Cangrejos

source: Shrooms
es: Hongos

source: Serpents
es: Serpientes

source: Mud Crawlers
es: Reptadores de barro

source: Move Ryuuma to the eastern edge of the map
es: Llevar a Ryuuma al borde este del mapa

source: Avoid killing too many scorpions.
es: Evita matar demasiados escorpiones.

source: Recall only non-scout units.
es: Reincorpora solo unidades que no sean exploradores.

source: The Shrooms are invulnerable.
es: Los hongos son invulnerables.

source: I see the entrance to another huge cavern!
es: ¡Veo la entrada a otra enorme caverna!

source: I see a lot of movement ahead!
es: ¡Veo mucho movimiento más adelante!

source: We better make camp here to rally the soldiers.
es: Mejor acampemos aquí para reunir a los soldados.

source: Ah, I see. It's an underground mushroom forest! It is growing over a quagmire. I wonder what manner of interesting fauna and flora we might see while traversing through here.
es: Ah, ya veo. ¡Es un bosque subterráneo de hongos! Crece sobre un pantano. Me pregunto qué tipo de fauna y flora interesante encontraremos al atravesarlo.

source: Lord Ryuuma, should we try an exploration here?
es: Señor Ryuuma, ¿deberíamos explorar por aquí?

source: I would like to do so as well however, time is of the essence. We must press on.
es: A mí también me gustaría, pero el tiempo apremia. Debemos seguir adelante.

source: I shall rally my troops right away and begin preparations to mobilise. You can start at your pace and maybe explore the area a bit. Who knows what we may find.
es: Reuniré a mis tropas de inmediato y comenzaré los preparativos para avanzar. Ustedes pueden empezar a su ritmo y tal vez explorar un poco la zona. Quién sabe qué encontraremos.

source: There is a lot of rough terrain here. I hope I can recall the right veterans for this exploration.
es: Hay mucho terreno difícil aquí. Espero reincorporar a los veteranos adecuados para esta exploración.

source: The majority of terrain in this map is mushrooms, caves and swamp. In cases such as this, recalling Aragwaith Scouts, Aragwaith Eagle Riders and their advancements should be avoided. Instead, focus on recalling foot-based units.Recalling an additional healer to complement Soryu can be a valuable decision to make in this scenario.
es: La mayor parte del terreno en este mapa son hongos, cuevas y pantano. En casos como este, evita reincorporar exploradores aragwaithi, jinetes de águila aragwaithi y sus avances. En su lugar, enfócate en reincorporar unidades de infantería. Reincorporar un sanador adicional para complementar a Soryu puede ser una decisión valiosa en este escenario.

source: Enemies will spawn at set intervals randomly on the map. You should always position your units defensively when ending a turn. Your objective is escorting Ryuuma to the eastern edge of the map and you should prioritise that.
es: Los enemigos aparecerán a intervalos fijos de forma aleatoria en el mapa. Siempre debes posicionar tus unidades de forma defensiva al terminar el turno. Tu objetivo es escoltar a Ryuuma hasta el borde este del mapa y debes priorizar eso.

source: What is going on?
es: ¿Qué está pasando?

source: The whole place is shaking uncontrollably.
es: Todo el lugar tiembla sin control.

source: Something has been awoken...
es: Algo ha despertado…

source: Fascinating...a matriach among the scorpions! A rare creature!
es: ¡Fascinante… una matriarca entre los escorpiones! ¡Una criatura rara!

source: Rare and looks very vicous. I think we have been perceived as intruders in her territory.
es: Rara y parece muy feroz. Creo que nos han percibido como intrusos en su territorio.

source: Tread past her if you can. If confrontation is inevitable, we must be ready for battle.
es: Pasa de largo si puedes. Si el enfrentamiento es inevitable, debemos estar listos para la batalla.

source: This path leads us out of here. Let us leave immediately. I do not see these scorpions retreating anytime soon.
es: Este camino nos saca de aquí. Vámonos de inmediato. No veo a estos escorpiones retirándose pronto.

source: We have wasted too much time here!
es: ¡Hemos perdido demasiado tiempo aquí!

source: We are surrounded by scorpions! I do not see any end to this!
es: ¡Estamos rodeados de escorpiones! ¡No veo fin a esto!

source: The abundance of mushrooms here make this perfect location for a breeding ground. A breeding ground for many species of scorpion.
es: La abundancia de hongos hace de este lugar un sitio perfecto para criar. Un criadero para muchas especies de escorpión.

source: We should form a defensive formation and avoid getting stung by the scorpion venom while tread through this place.
es: Deberíamos formar una formación defensiva y evitar que nos piquen con el veneno de los escorpiones mientras atravesamos este lugar.

source: Hey, it's more of those giant crab creatures again!
es: ¡Oye, son más de esas criaturas cangrejo gigantes otra vez!

source: These look more wild than the domesticated ones we saw at the fortress. Where are they coming from?
es: Estos parecen más salvajes que los domesticados que vimos en la fortaleza. ¿De dónde salen?

source: We should avoid engaging them as they seem to be interesting in brawling with the scorpions.
es: Deberíamos evitar enfrentarlos, ya que parecen interesados en pelear con los escorpiones.

source: Saurians are here too? They might be guarding their treasure hoard.
es: ¿También hay saurios aquí? Tal vez estén custodiando su tesoro.

source: I would conflicting with them if I can. However, the chance of getting a considerable amount of treasure does sound tempting.
es: Evitaría enfrentarlos si puedo. Sin embargo, la posibilidad de obtener una buena cantidad de tesoro suena tentadora.

source: It's the invaders! They are coming for the fortress! Stop them here!
es: ¡Son los invasores! ¡Vienen por la fortaleza! ¡Deténganlos aquí!

source: Fortress? What fortress?
es: ¿Fortaleza? ¿Qué fortaleza?

source: Avoid striking the giantic mushroom creatures. I think they will release the spores on their surface when hit so it will be bad for us if that happens.
es: Evita golpear a las criaturas hongo gigantes. Creo que liberarán las esporas de su superficie al ser golpeadas y eso sería malo para nosotros.

source: It may have been the last of its kind...
es: Tal vez fue el último de su especie…

source: It does not sound triumphant when you word it like that.
es: No suena triunfal cuando lo dices así.

source: Lake in the Depths
es: Lago en las profundidades

source: A New Ally
es: Un nuevo aliado

source: team_name^Windsong
es: Hijas del Viento

source: These caverns seem to be getting darker and more ominous.
es: Estas cavernas se ven cada vez más oscuras y siniestras.

source: Aye. However, we must press on.
es: Sí. Sin embargo, debemos seguir adelante.

source: I see what appears to be a crossroads ahead.
es: Veo lo que parece un cruce más adelante.

source: Which way do we go now?
es: ¿Por dónde vamos ahora?

source: Food and water are running a bit low right now.
es: La comida y el agua están un poco escasas ahora.

source: I believe we should pitch camp here. I can see most of us are exhausted right now and we should all get some rest.
es: Creo que deberíamos acampar aquí. Veo que la mayoría está agotada y todos necesitamos descansar.

source: How long do you think has it been since we descended underground, Soryu?
es: ¿Cuánto crees que ha pasado desde que bajamos al subsuelo, Soryu?

source: I would say a week or so.
es: Diría que una semana más o menos.

source: A campfire such as this reminds of the time when I was stationed near the southern border. The war waged on and we fought on.
es: Una fogata como esta me recuerda la época en que estuve estacionado cerca de la frontera sur. La guerra continuaba y nosotros seguíamos luchando.

source: Would you tell us a tale from your adventures? We read about them but to hear them from the very source. Now, that would be grand.
es: ¿Nos contarías una historia de sus aventuras? Leímos sobre ellas, pero escucharlas de la fuente misma sería genial.

source: Why certainly! There was...
es: ¡Claro que sí! Hubo una vez…

source: Lord Ryuuma, I see movement in the darkness!
es: ¡Señor Ryuuma, veo movimiento en la oscuridad!

source: I am seeing a lot of pairs of bluish eyes in the darkness ahead!
es: ¡Veo muchos pares de ojos azulados en la oscuridad adelante!

source: Same here.
es: Yo también.

source: Same from here as well.
es: Igual desde aquí.

source: Quick, take defensive...
es: ¡Rápido, posiciones defensivas…

source: Oh, no! We are surrounded!
es: ¡Oh, no! ¡Estamos rodeados!

source: Hold fast! Close ranks!
es: ¡Manténganse firmes! ¡Cierren filas!

source: This is going to be an ugly fight...
es: Esto va a ser una pelea fea…

source: Wait! They are not your enemy!
es: ¡Espera! ¡No son sus enemigos!

source: They are not? But...they are humans!
es: ¿No lo son? ¡Pero… son humanos!

source: That is true. However, if you look closer, you see they are all silver golden-haired and have green eyes. The ones you have a bitter feud with have black hair and always wear armor.
es: Es cierto. Pero si miras más de cerca, verás que todos tienen cabello plateado dorado y ojos verdes. Los que tienen una enemistad amarga contigo tienen cabello negro y siempre usan armadura.

source: They are aragwaithi.
es: Son aragwaithi.

source: Tell me, Aragwaithi. What are you doing here?
es: Dime, aragwaithi. ¿Qué hacen aquí?

source: Pretty far from home, isn't it?
es: Bastante lejos de casa, ¿no?

source: Windsong. I never would have guessed we would run into you here out of all places. I should be asking the same question.
es: Hijas del Viento. Nunca imaginé que nos encontraríamos aquí de todos los lugares. Debería hacerte la misma pregunta.

source: To answer your question: we are on a mission to stop the valefolk from raiding aragwaithi territory ever again. They have raided far too many of our villages.
es: Para responder tu pregunta: estamos en una misión para evitar que los habitantes del valle vuelvan a saquear territorio aragwaithi. Han saqueado demasiados de nuestros pueblos.

source: We, Windsong, are on a clandestine mission as well. These deep elves, the followers of Shassagoth, are our allies. They are escorting us where we need to go.
es: Nosotras, Hijas del Viento, también estamos en una misión secreta. Estos elfos profundos, seguidores de Shassagoth, son nuestros aliados. Nos escoltan a donde necesitamos ir.

source: Lately, they have clashed with the valefolk and their dwarven allies in the depths of Irdya.
es: Últimamente han chocado con los habitantes del valle y sus aliados enanos en las profundidades de Irdya.

source: So, we shall let them live?
es: Entonces, ¿los dejaremos vivir?

source: Yes, and maybe they can even help you out. You both are fighting the valefolk and their allies. So, it does make sense to establish a temporary alliance.
es: Sí, y tal vez hasta puedan ayudarlos. Ambos luchan contra los habitantes del valle y sus aliados. Tiene sentido establecer una alianza temporal.

source: As much as I would like to converse with your sorceresses over tea here, we must be going. It was nice to meet you, aragwaithi. We shall be on our way now. The urgency demands it.
es: Por más que quisiera charlar con sus hechiceras tomando té, debemos irnos. Fue un gusto conocerlos, aragwaithi. Nos vamos. La urgencia lo exige.

source: I have sent a scout back to the main group preparing to fight near by. One of their leaders will come and tell you the details. I suggest you wait and rest till then.
es: Envié un explorador al grupo principal que se prepara para pelear cerca. Uno de sus líderes vendrá a explicarles los detalles. Sugiero que esperen y descansen hasta entonces.

source: The Windsong and their deep elven allies disengaged and resumed their southern trek. At a glance, Hikaru could interprete that the Windsong, as few as they were, were battle-hardened and their countenances revealed the significane of their mission. Like them, the aragwaithi were on a similar mission.
es: Las Hijas del Viento y sus aliados elfos profundos se retiraron y reanudaron su marcha hacia el sur. De un vistazo, Hikaru pudo notar que las Hijas del Viento, aunque pocas, estaban curtidas en batalla y sus rostros revelaban la importancia de su misión. Al igual que ellas, los aragwaithi estaban en una misión similar.

source: Note from Lord-Knightmare
es: Nota de Lord-Knightmare

source: If you are curious to know who Yuki, Marin, and Erilyn are and what their mission is, please play <i>Blackfire</i>, a campaign that takes around as the same time as this one.
es: Si tienes curiosidad por saber quiénes son Yuki, Marin y Erilyn y cuál es su misión, por favor juega <i>Blackfire</i>, una campaña que dura aproximadamente lo mismo que esta.

source: That was...intense.
es: Eso fue… intenso.

source: (sheathing back swords)
es: (envainando las espadas)

source: Indeed, I felt like we were goners.
es: Sí, sentí que estábamos perdidos.

source: The aragwaithi and windsong have fought alongside each other during the First Elemental War. They are remember and so do we. The windsong have saved us today. We now have time to resume our rest.
es: Los aragwaithi y las Hijas del Viento lucharon juntos durante la Primera Guerra Elemental. Ellos nos recuerdan y nosotros también. Las Hijas del Viento nos salvaron hoy. Ahora tenemos tiempo para descansar.

source: Let us rest as much as we can. Another battle does not seem faraway.
es: Descansemos todo lo que podamos. Otra batalla no parece estar lejos.

source: Enemy of My Enemy
es: El enemigo de mi enemigo

source: Spiders
es: Arañas

source: Objective I
es: Objetivo I

source: Intercept and destroy any caravans you find
es: Interceptar y destruir cualquier caravana que encuentres

source: Objective II
es: Objetivo II

source: Defeat all enemy leaders
es: Derrotar a todos los líderes enemigos

source: Death of Vanleneada
es: Muerte de Vanleneada

source: Right-Click on Hikaru or Ryuuma to see How to Play Guide.
es: Haz clic derecho sobre Hikaru o Ryuuma para ver la guía de cómo jugar.

source: Some cave walls are collapsable.
es: Algunas paredes de la cueva son derrumbables.

source: Well, here we are.
es: Bien, aquí estamos.

source: According to the intelligence reports shared with us by the Deep Elves, the walls in this cavern are quite thin and minimal force would collapse the walls. We can this advantage to let the enemy trigger some wall breaks.
es: Según los informes de inteligencia que nos compartieron los elfos profundos, las paredes de esta caverna son bastante delgadas y poca fuerza bastaría para derrumbarlas. Podemos usar esta ventaja para que el enemigo active algunos derrumbes.

source: The Deep Elves have also scattered their forces in these caverns and are waiting for the opportune strike to ambush the unsuspecting Valefolk and their Dwarven allies.
es: Los elfos profundos también han dispersado sus fuerzas en estas cavernas y esperan el momento oportuno para emboscar a los desprevenidos habitantes del valle y sus aliados enanos.

source: Then let us prepare out forces as well.
es: Entonces preparemos nuestras fuerzas también.

source: Hikaru, I have decided to consolidate our forces. We stand a better chance in this battle as an united force instead of distincy regiments.
es: Hikaru, he decidido consolidar nuestras fuerzas. Tenemos más posibilidades en esta batalla como una fuerza unida en lugar de regimientos separados.

source: You can now recruit veteran Aragwaith units.
es: Ahora puedes reclutar unidades veteranas aragwaithi.

source: Ryuuma is an Aragwaith Shield Guard. He is quite strong in melee combat. However, his true potential comes from his nearly overwhelming defensive strength and self-sustenance. It is advisable to keep Ryuuma as the vanguard of any attacking force or the key defender of any bottleneck to maximise his abilities and resistances.
es: Ryuuma es un guardia con escudo aragwaithi. Es bastante fuerte en combate cuerpo a cuerpo. Sin embargo, su verdadero potencial viene de su fuerza defensiva casi abrumadora y su autosostenimiento. Es recomendable mantener a Ryuuma como vanguardia de cualquier fuerza de ataque o como defensor clave en cualquier cuello de botella para maximizar sus habilidades y resistencias.

source: The skirmishes here will mostly be in narrow cave sections. I advise against recalling any scouts or eagle riders as they will not be fully effective.
es: Los combates aquí serán mayormente en secciones estrechas de cuevas. Recomiendo no reincorporar exploradores ni jinetes de águila, ya que no serán completamente efectivos.

source: Instead, let us stick to our infantry based veterans to thwart the enemies.
es: En su lugar, quedémonos con nuestros veteranos de infantería para frenar a los enemigos.

source: There might be a lot of caravans moving about here.
es: Puede haber muchas caravanas moviéndose por aquí.

source: I think the best approach would be rush our forces to the end of all the tunnels and flank the approaching caravans from there.
es: Creo que el mejor enfoque sería apresurar nuestras fuerzas hasta el final de todos los túneles y flanquear a las caravanas que se acerquen desde allí.

source: Strike them, my sisters! The Will of Shassagoth is clear and concise! These invaders must be stopped!
es: ¡Golpeen, hermanas! ¡La voluntad de Shassagoth es clara! ¡Estos invasores deben ser detenidos!

source: That appears to be the last of the caravans.
es: Esa parece ser la última caravana.

source: That was the last of the enemy commanders here.
es: Ese fue el último comandante enemigo aquí.

source: We seem to have these caverns under our control now.
es: Parece que ahora tenemos estas cavernas bajo control.

source: The enemy has been defeated here. The way to their fortress lies undefended. Let us proceed!
es: El enemigo ha sido derrotado aquí. El camino a su fortaleza está sin defensa. ¡Avancemos!

source: Oh, no! We have let the Deep Elven general die!
es: ¡Oh, no! ¡Dejamos que muriera la general elfa profunda!

source: The situation seems hopeless now.
es: La situación parece desesperada ahora.

source: Bastion of the Forgotten
es: Bastión de los olvidados

source: Drakes
es: Dracos

source: Find and disable the mechanism of the bridge
es: Encontrar y desactivar el mecanismo del puente

source: Hold off the enemy forces
es: Contener a las fuerzas enemigas

source: You are severely outnumbered.
es: Estás en gran desventaja numérica.

source: The devices that was keeping the bridge active are enemy units.
es: Los dispositivos que mantienen activo el puente son unidades enemigas.

source: Ah, their fortress lies just beyond the massive cave platform. It seems they have taken measures against us and have stationed what remains of their forces in the ancient fortifications.
es: Ah, su fortaleza está justo más allá de la enorme plataforma de la cueva. Parece que tomaron medidas contra nosotros y han estacionado lo que queda de sus fuerzas en las antiguas fortificaciones.

source: Indeed, they have. As much as I would like to disrupt what foul ritual they are performing with the stolen artifacts, it seems we have to change plans.
es: En efecto, lo hicieron. Por más que quisiera interrumpir el ritual maligno que están haciendo con los artefactos robados, parece que debemos cambiar de planes.
